["Ключевые достижения:\n- Руководство командой разработчиков, включая бэкенд, фронт, дизайнеров, бизнес-аналитиков и системных аналитиков.\n- Разработка и поддержка около 50 микросервисов с использованием Spring Boot, RabbitMQ, Docker, PostgreSQL, Kafka, Redis, Elasticsearch, Java, Kotlin, Keycloak, Gradle, Maven.\n- Создание микросервисов с нуля и до релиза, интеграция микросервисов со смежными системами по протоколу взаимодействия Rest.\n- Взаимодействие со смежными командами, функциональным тестированием, нагрузочным тестированием.\n- Полная поддержка релизного цикла, от создания и заведения модуля до пси и нагрузочного тестирования.\n- Разработка и поддержка кода на Java 8, 11, Spring, Spring Boot, Spring Webflux, Reactor, Kafka, Maven, Git, Hibernate, Unit тестирование, Integration тестирование, SonarQube, Jenkins, Oracle, PostgreSQL, HTML, CSS, JavaScript, kubernetes, контейнеризация, Swagger, логирование, Grafana, алерты, Jira, Confluence.", "Ключевые достижения:\n\n1. Разработка инструмента-приложения для тестирования микросервисов на Groovy.\n2. Перевод проекта с версии Grails 2.1 на версию 2.5.\n3. Интеграция приложения со сторонней лабораторией LIMS.\n4. Внедрение критически важного для бизнеса рабочего процесса для обработки исправлений.\n5. Миграция всех устаревших технологий на современные.\n6. Разработка веб-сервиса для расчета текущей фазы продажи и микро-веб-сервиса для управления лимитами заказа.", "В период с 2019 по 2022 год работал ведущим java разработчиком. Занимался анализом целевых систем, разработкой интеграционных решений и коннекторов к IDM системе. Также проводил менторство и обучение новых разработчиков, а также управление командой. Использовал стек технологий: java 8, osgi, postgresql, testng, mockito, maven, rest.\n\nВ период с 2018 по 2019 год работал программистом Java. Разрабатывал настольные приложения и REST-сервисы для нужд компании, писал, модифицировал и сопровождал программную документацию и спецификации, а также проверял код и устранял ошибки для повышения производительности. Использовал стек технологий: java 8, javafx, postgresql, hibernate, testng, mockito, spring.\n\nВ период с 2017 по 2018 год работал фриланс-разработчиком. Создавал пользовательские мобильные приложения с использованием нативных технологий в соответствии с требованиями заказчика, а также проектировал и разрабатывал услуги отдыха. Использовал стек технологий: c#, sqllite, java 8, rest, spring, postgresql, sqllite.", "Ключевые достижения:\n- Опыт работы с различными стеками технологий, включая Java, Spring, Hibernate, PostgreSQL, Docker, Kafka, myBatis, InfluxDB, GitLab, Jenkins, REST, FlyWay, Webservices, Microservices, HTML, CSS, JavaScript, MySQL, PostgreSQL, MongoDb, JDBC, Jira, Apache POI, LiqueBase, C#, JavaScript.\n- Участие в разработке и поддержке интеграционной шины данных реестра объектов ЖКХ города Москвы.\n- Участие в развитии и поддержке модулей собственного продукта компании.\n- Разработка и сопровождение новых модулей на микро-сервисной архитектуре для Московской Государственной Экспертизы, Московской Департамент территориальных органов исполнительной власти города Москвы и информационно-аналитической системы Департамента территориальных органов исполнительной власти города Москвы.\n- Разработка автоматической торговой системы для платформы MetaTrader4 по алгоритму заказчика.\n- Разработка полного цикла на движке Unity3D.", "Период работы 2022-02-01 - None на позиции Senior Backend Devloper.\nОпыт работы:\n- Работа с PostgreSQL, Spring Boot, RabbitMQ и Kafka.\n- Создание GraphQL подписчиков для передачи геокоординат в приложение.\n- Переработка нестабильного микросервиса Event-Sourcing для использования традиционного подхода.\n- Прототипирование миграции другого микросервиса на DoltDB.\n- Работа с Camunda 7 - обновление Camunda с помощью Liquibase, очистка истории Camunda.\n\nПериод работы 2020-10-01 - 2022-02-01 на позиции Ведущий разработчик.\nОпыт работы:\n- Исправление кода работы с Hazelcast, удаление ImageMagick, отказ от Kafka, удаление самописной реализации CQRS, оптимизация SQL запросов.\n- Написание сериализатора Spring Statemachine, сохраняющего состояние в таблицу как jsonb.\n- Организация процесса деплоя доработок в прод, координация команд сопровождения и команды нагрузочного тестирования.\n\nПериод работы 2019-11-01 - 2020-10-01 на позиции Старший разработчик.\nОпыт работы:\n- Обновление MongoDB с версии 3 до 4, внедрение интеграционных автотестов, вывод из эксплуатации микросервиса.\n- Версионирование позиций, подобное MVCC в PostgreSQL.\n\nПериод работы 2017-08-01 - 2019-11-01 на позиции Эксперт.\nОпыт работы:\n- Интеграция с партнерами и вендорами, поддержка и рефакторинг микросервисной архитектуры.\n- Удаление вендорского кода, прорефакторинг Spring Security, покрытие его тестами.\n- Схлопывание 5 микросервисов в 1 для упрощения отладки и тестирования.\n- Удаление привязки к вендорскому решению, настройка GC в docker registry.\n- Приведение механизма обработки исключений к общему виду.\n- Подъем мастер-ноды Jenkins, перенос на нее задач со старой.\n- Подъем Gitea для Spring Cloud Config, удаление Gitea.\n- Внедрение Spring Cloud Gateway, настройка Nexus.\n- Поддержка кластера Kubernetes.\n- Лидерство над 3 продуктовыми командами разработки и онбординг новых сотрудников.\n\nПериод работы 2015-04-01 - 2017-08-01 на позиции Инженер-программист.\nОпыт работы:\n- Написание компонентов высоконагруженной платформы, настройка Jenkins, создание docker-compose сборок проекта, объединение модулей в один репозиторий, настройка gradle-скриптов.\n- Внедрение интеграционных автотестов на связке Groovy + Rest Assured, установка этого на Jenkins.\n\nПериод работы 2014-08-01 - 2015-04-01 на позиции Программист.\nОпыт работы:\n- Внедрение работы с виртуальными машинами VMware Workstation через ant-vix-tasks в тестовый фреймворк, последующий отказ от тасков в пользу vmrun.\n- Расширение функциональности тестового фреймворка для новых сценариев.", "Работал на позиции Java Software Engineer с 2024-01-01 по None. Занимался обсуждением требований, проработкой и декомпозицией задач, разработкой, оптимизацией и поддержкой нового функционала, написанием unit-тестов и интеграционных тестов, а также проведением код-ревью.\n\nРаботал на позиции Backend Developer с 2022-09-01 по 2023-12-01. Занимался разработкой и внедрением новых функций, обслуживанием программного обеспечения, разработкой системы для базы данных, выявлением и устранением багов. Использовал стек технологий: Java 17, Kafka, Elasticsearch, Spring, MongoDB, PostgreSQL, Git, GitLab, GitHub.\n\nРаботал на позиции Backend Developer с 2022-05-01 по 2022-08-01. Занимался разработкой проекта для ВТБ банка, разработкой программного обеспечения, Backend разработкой, внедрением новых функций. Использовал стек технологий: Java 8, Spring, Kafka, PosgreSQL. Причина ухода: вынужденное завершение работы в компании из-за политической ситуации.\n\nРаботал на позиции Backend Developer с 2020-03-01 по 2022-03-01. Занимался разработкой сервиса для ВинЛаб интернет магазина, разработкой программного обеспечения, Backend разработкой, разработкой системы для базы данных, выявлением и устранением багов. Использовал стек технологий: Java 8, Spring, Hybris, PosgreSql.", "Период работы 2021-06-01 - None на позиции Senior java developer.\nОпыт работы:\n- Создание сервисов с нуля(микросервисная архитектура)\n- Доработка существующих сервисов\n- Оптимизация производительности и выявление узких мест производительности\n- Код-ревью\n- Bug-fixing\n- Участие в проектировании сервисов\n\nПериод работы 2019-09-01 - 2021-06-01 на позиции Chief developer.\nОпыт работы:\n- Разработка высоконагруженной банковской системы для одного из крупнейших банков России\n- Введение новых модулей и функций, код-ревью, поддержка новых разработчиков\n- Использование стека технологий: Java 8-11, scala 2.11, gradle, Spring (Boot, MVC, Integration, AOP, Data, Web, Security, Batch), Spring Cloud(Cloud bus, Cloud stream, Eureka, Ribbon, Feign, Sleuth, Zipkin, Hystrix, Turbine, Retry, Zuul), Hadoop ecosystem, Hibernate Specification, code testing tools(JUnit, assertJ, Spring Test, Mockito, Cloud Contracts), doc libraries(Jasper reports, Apache POI), util methods libraries(Spring utils, Apache Commons, Guava etc.), ELK, RabbitMQ\n- Тестирование инструментов: Postman, JMeter\n- Работа с базами данных: Oracle, Mongodb, Redis\n- Использование DevOps инструментов: Docker, Kubernetes, Helm, Jenkins, Bitbucket, Gitlab\n- Работа с инструментами для командной разработки: Jira, Confluence\n- Методология работы: Scrum (две недели спринта, планирование (покер), grooming и т.д.)\n\nПериод работы 2018-08-01 - 2019-09-01 на позиции Lead Developer.\nОпыт работы:\n- Разработка мониторинга системы для визуализации, контроля и оценки работоспособности систем водоснабжения, освещения, электричества, вентиляции, температуры, движения сотрудников в здании для Московского строительного департамента\n- Использование стека технологий: Java 8, kotlin, maven, Spring (Boot, MVC, AOP, Data, Web, Security, WebSocket), Spring Cloud(Eurika, Ribbon, Feign, Sleuth, Zipkin, Hystrix, Cloud Gateway), Hibernate Specification, Envers, code testing tools(JUnit, assertJ, Spring Test, Mockito), doc libraries(YARG, Apache POI), util methods libraries(Spring utils, Apache Commons, Guava etc.), функциональная библиотека для kotlin(Arrow-kt), ELK, Swagger\n- Тестирование инструментов: Insomnia\n- Работа с базами данных: Postgresql, MongoDB\n- Использование DevOps инструментов: Docker, Kubernetes, GitLab\n- Работа с инструментами для командной разработки: GitLab\n- Методология работы: Scrum (две недели спринта, планирование (покер), grooming и т.д.)\n\nПериод работы 2017-04-01 - 2018-07-01 на позиции Software Engineer.\nОпыт работы:\n- Нет доступной информации о предыдущих местах работы", "Опыт работы:\n- 2021-08-09 - None, Ведущий разработчик. Создание новой системы по управлению заказами на микросервисной архитектуре с нуля. Основной стек технологий: java, spring boot, rest, postgre sql, spring data jpa, hibernate, spring data jdbc, kafka, docker, kubernetes.\n- 2020-07-09 - 2021-08-09, Инженер-программист. Разработка backend на микросервисной архитектуре для личного кабинета Мегафон, REST API. Участие в проведении собеседований. Основной стек: Java, Spring Framework, Hibernate, SQL(PostgreSQL, ORACLE), NoSQL(MongoDB), Docker, Kubernetes, Git Java · Spring Boot · PostgreSQL · MongoDB · Docker · SQL · Nosql · Oracle sql · Hibernate · Rest.\n- 2018-03-09 - 2020-07-09, Инженер-программист АСУТП. Конфигурирование, программирование и работа с программными продуктами Yokogawa; Изучение причин отказов и нарушений в системе, анализ информации, составление отчетов; Переговоры с иностранными заказчиками, ежедневная коммуникация с зарубежными коллегами. Java · HTML · CSS · SQL · Администрирование сетей · Администрирование серверов · Hyper-v.", "Ключевые достижения:\n\n1. Реализация микросервисной архитектуры для проекта документооборота с контрагентами, интеграции с ФНС и отправки отчетности.\n2. Участие в проектах по разработке интеграционной шины для автоматизации процессов взаимодействия между сервисами государственных структур и системы электронного документооборота.\n3. Опыт работы с различными технологиями и фреймворками, включая Spring Boot, PostgreSQL, Kafka, REST API, Spring Security, Spring Data, Spring Web, Hibernate ORM, Swagger, Lombok, Junit, Mockito, MyBatis, RabbitMQ.\n4. Опыт работы с Java 8, Java 17, Spring Framework, Hibernate ORM, Lombok, MapStruct, PostgreSQL, GitLab.\n5. Опыт разработки модульных тестов, оценки и обсуждения задач, технического сопровождения, работы с БД, код ревью и рефакторинга кода.", "Период работы 2022-10-01 - None на позиции Java Software Developer.\n\nКлючевые достижения:\n- Успешная миграция устаревшей кодовой базы с Jboss Seam на Spring framework, что привело к повышению производительности и удобства обслуживания приложений на 25%.\n- Руководство текущим обслуживанием и решением сложных технических проблем в рамках устаревшей системы, обеспечение ее постоянной стабильности и функциональности.\n- Участие в разработке и интеграции многочисленных внутренних и сторонних сервисов, повышение функциональности и эффективности системы.\n- Грамотная навигация по текстам, документации и бизнес-спецификациям на французском языке, способствующая четкой коммуникации и точному выполнению требований проекта.\n\nПериод работы 2021-03-01 - 2022-10-01 на позиции Lead Java Developer.\n\nКлючевые достижения:\n- Руководство командой из 4 разработчиков и 1 бизнес-аналитика.\n- Оптимизация работы более 200 менеджеров, сокращение 2 часов ежедневной работы для каждого менеджера, экономия более 2500 человеко-часов в месяц для Заказчика.\n- Руководство процессом создания информационной системы для централизации всей внутренней информационной базы компании.\n- Сокращение расходов Клиента на обмен сообщениями между банками. Замена бумажного документооборота на более чем 200 тысяч ежедневных электронных запросов.\n\nПериод работы 2019-04-01 - 2022-10-01 на позиции Java Software Developer.\n\nКлючевые достижения:\n- Разработка и устранение неполадок высоконагруженного приложения для сбора долгов с более чем 600 тысячами строк кода.\n- Оптимизация ключевой функциональности, оптимизация дорогостоящих SQL-запросов. Сокращение временных затрат на настройку платежного запроса на 67%.\n- Разработка и внедрение системы сбора всех тендеров с 8 крупнейших тендерных площадок Казахстана с подробной аналитикой и прогнозом прибыльности участия.\n- Руководство разработкой системы автоматизации кадровых процессов. Автоматизация всех этапов работы сотрудника в компании.\n- Техническая поддержка, устранение неполадок и разработка высоконагруженного проекта с 500 тыс.+ строк кода, большим набором процедур pl/pgSQL, оптимизация SQL-запросов, работа с многопоточностью.\n- Разработка системы сбора и дальнейшей продажи продуктов с истекающим сроком годности. Интеграция API с 2 крупными торговыми сетями, разработка интернет-магазина для продажи.", "Ключевые достижения:\n- Опыт разработки и поддержки микросервисных систем на Kotlin и Java.\n- Опыт работы с Spring Boot, Elasticsearch, Flow, Project Reactor, Kafka, Http, PostgreSQL.\n- Опыт разработки внутренних инструментов и плагинов для IDEA.\n- Опыт работы с Docker, GCP, RabbitMQ, MongoDB.\n- Опыт работы с Java 7, Java 8, Vaadin.\n- Опыт работы с Spring Framework, Hibernate, PostgreSQL, MongoDB.", "В период с 2021 по 2020 год работал на позиции Старший Java-разработчик и Java-разработчик соответственно. Занимался разработкой, проектированием и сопровождением проектов на микросервисной архитектуре, а также разработкой универсальных программных решений в области передачи, агрегации и преобразования данных. Оптимизировал схему базы данных, что привело к увеличению пропускной способности приложения. Использовал стек технологий: Java, Kotlin, Spring Framework, Spring Boot, PostgreSQL, Apache Kafka, IBMQ, WebFlux.\n\nВ период с 2020 по 2019 год занимался разработкой и проектированием веб-аппликаций с нуля, интеграцией со сторонними и внутренними системами и службами. Разрабатывал новый функционал и поддерживал существующий. Использовал стек технологий: Java, Spring Framework, Spring Boot, PostgreSQL, Docker, Kafka, WebFlux, Maven, Git.", "В период с 2018 по 2014 годы работал на позиции ведущего инженера-программиста. Занимался проектированием и разработкой на Java, а также участвовал в проектах по созданию порталов государственных услуг и бизнес-навигатора МСП.\n\nВ период с 2008 по 2014 годы работал на позиции ведущего инженера-программиста. Разрабатывал проекты на Java, включая портал государственных услуг Московской области и портал бизнес-навигатора МСП. Также занимался обучением новых сотрудников и постановкой задач для исполнения.\n\nВ период с 2006 по 2007 годы работал на позиции инженера-программиста. Участвовал в разработке проектов на системе создания распределенных приложений Sitex, включая порталы ОГВ ТО и ФСБ.", "Ключевые достижения:\n\n1. Разработка и поддержка более 10 микросервисов.\n2. Ведение разработки двух микросервисов с нуля.\n3. Проработка бизнес-логики с заказчиками.\n4. Архитектура микросервисов.\n5. Создание микросервисов.\n6. Реализация бизнес-логики.\n7. Рефакторинг.\n8. Добавление нового функционала.\n9. Поиск ошибок.\n10. Работа с эндпоинтами в контроллерах.\n11. Работа с базами данных.\n12. Создание DTO и сущностей.\n13. Использование различных технологий, включая Java, Spring, Spring Cloud, RabbitMQ, Kafka, WebFlux, Swagger, PostgreSQL, MySQL, Hibernate, Docker, Kubernetes, Openshift, Redis, MongoDB, Jenkins, JUnit5, Mockito, Testcontainers, Lombok, React, MapStruct, ModelMapper, Travis CI, PromQL, Grafana, Tomcat\\Netty, SSL\\TLS HTTP\\HTTPS и другие.", "Ключевые достижения:\n- Опыт разработки микросервисов на Java с использованием Spring Boot, SOAP, AOP, Feign-клиентов, Kafka Spring, Spring Webflux, HazelCast, PostgreSQL, Apache Spark, JOOQ, Flyway, JUnit, Swagger, Gitlab, Jira, Maven, Bitbucket, Sonar, Openshift, Teamcity.\n- Опыт работы с различными стеками технологий, включая Java 17, Spring Boot, SOAP, AOP, Feign-клиенты, Kafka Spring, Spring Webflux, PostgreSQL, Apache Spark, JOOQ, Flyway, JUnit, Swagger, Gitlab, Jira, Maven, Bitbucket, Sonar, Openshift, Teamcity.\n- Опыт работы с различными инструментами и платформами, такими как Jira, Confluence, Maven, Git, Bitbucket, Sonar, Openshift, Teamcity.", "Что-то в вашем вопросе меня смущает. Может, поговорим на другую тему?", "Опыт работы:\n- Java Developer (2022-03-01 - None): Разработка системы унификации аптечных продуктов с нуля. Использование стека технологий: Java 17, Boot 3, Psql, Clickhouse, MongoDb, Redis, Spring Cloud, Docker, K8s, ELK, Kafka.\n- Инженер-программист (2019-08-01 - 2022-03-01): Разработка и поддержка функционала на Spring, Oracle, MySql, Hibernate, Jpa. Работа над проектами: смс-рассылки, мелодии на телефонный звонок, просмотр cdr сервиса, переработанный проект по мелодиям на телефонный звонок, единое окно авторизации, утилиты для проектных целей. Использование технологий: Java 8, Java 6, Spring Boot, Clickhouse, MySql, Typescript/Custom vue based framework, Kotlin, Spring based framework, Ldap.", "В период с 2021 по настоящее время работал на позиции Senior Java Software Engineer. Занимался разработкой бекенда для мобильного приложения платежной системы в связке с solana blockchain. Использовал микросервисную архитектуру, модули spring-cloud и spring-boot, языки программирования kotlin/java. Имеет опыт разработки в реактивной парадигме с использованием webflux, coroutine и r2bc. Знаком с миграциями с помощью flyway migration и интеграцией с solana blockchain. Также имеет опыт работы с gradle и внешними сервисами.\n\nВ период с 2020 по 2021 год работал на позиции Старший Java разработчик. Участвовал в разработке микросервисов и библиотек для проекта Омниканальной платформы на базе spring-boot 2.0 и java 11. Имеет опыт работы с Apache Kafka, Elasticsearch, миграцией микросервисов с java 8 на java 11 и spring-boot 1.5 на версию 2.0. Знаком с Hibernate ORM, liquibase и webflux. Имеет базовые знания openshift и kubernetes. Умеет выполнять задачи по улучшению работы существующего пайплайна, писать unit и интеграционные тесты, проводить code-review и работать с системой Jira.\n\nВ период с 2019 по 2020 год работал на позиции Java разработчик. Занимался разработкой платформенных микросервисов и библиотек для проекта ДБО на базе spring-boot 2.0 и java 8-11. Имеет опыт работы с Apache Kafka, Elasticsearch, PostgreSQL, IBM MQ, REST API, spring-cloud, kubernetes, Hibernate ORM, liquibase, Maven, code-review, Jira и agile/scrum.", "Ключевые достижения:\n- Опыт работы в роли Tech Lead, включая управление проектами и командами разработчиков.\n- Разработка и внедрение CRM-системы для малого бизнеса, что позволило повысить пропускную способность канала и сократить время каждого разговора с клиентом на 20%.\n- Создание АРМ сотрудника поддержки торгового эквайринга для 300 сотрудников, что включало разработку архитектуры решения, планирование этапов реализации и контроль выполнения проекта.\n- Разработка веб-версии платформы SberStack для 600+ корпоративных архитекторов банка, выведение системы в промышленную эксплуатацию.\n- Управление кросс-функциональной командой (12 человек) для создания платформы для выплат льгот и субсидий по ЖКУ в Москве.\n- Доработка системы Infor WMS под нужды заказчиков, включая реализацию доработок для крупных сетей продуктов питания, фармацевтического склада и сети магазинов одежды.", "Ключевые достижения:\n- Реализация сервисов банка и интеграция с ЦБ по проекту цифровой рубль;\n- Разработка сервисов валидирующих юридические сделки;\n- Интеграция с провайдерами контента и оптимизация SQL запросов;\n- Разработка микросервисов для сервиса доставки готовой еды;\n- Доработка и поддержка функционала проекта почта России, сервиса логистики;\n- Выполнение работ по настройке, доработке, поддержке программного обеспечения и информационной системы GK Retail.", "Ключевые достижения:\n- Опыт разработки и поддержки сервисов для МКК на Java 11 с использованием стека технологий, включающего Jenkins, JDBCTemplate, JUnit, Spring framework (Core, Security, MVC, Boot), OracleDb, Apache Maven, Jetty, Git, HTML, Thymeleaf, Jira, Confluence, BitBucket, SonarQube.\n- Опыт разработки серверной части приложения на IOS на Java 8 с использованием JavaFX, Hibernate/JPA, JUnit, Spring framework (Core, Security, MVC, Boot), MySQL, Apache Maven, Tomcat, Git, HTML, CSS, JavaScript (AJAX, JQuery), Thymeleaf, Bootstrap, Trello, Slack.", "В период с 2020 по 2022 год работал на позиции Разработчик. Занимался разработкой CRM системы для упрощения работы менеджеров и взаимодействия разных отделов компании. В рамках проекта занимался добавлением нового функционала, реализацией сервисного слоя, созданием DTO сущностей, работой с базой данных, написанием контроллеров, иногда тестированием и отловом багов. Использовал следующие технологии: Java 8, Spring Framework (web, boot, security, data), Hibernate ORM, Lombok, MySQL, JUnit, Maven, Gitlab.", "Резюме опыта работы:\n\n1. Период работы с 2019 по настоящее время на позиции Java Developer. Занимается разработкой микросервисов для проекта по заказу финтех компании. В команде из 13 специалистов разработал функционал детальной отчетности с хранением их через брокера сообщений и оптимизировал бизнес-логику.\n\n2. Период работы с 2015 по 2019 годы на позиции Java Developer. Занимался разработкой системы для управления рисками и защиты брендов компаний. Добавил функционал масштабирования нескольких предприятий, автоматическое отслеживание и визуализацию рабочего процесса и автоматизацию отчетности.\n\n3. Период работы с 2013 по 2015 годы на позиции Java Developer. Занимался разработкой функций и поддержкой онлайн-библиотеки Wiley. Совершил перенос приложения на новую версию, сделал интеграцию с инструментом Wiley Online Open и реализовал асинхронную обработку информации о лицензиях.", "Работал в качестве Java разработчика с 2020 года по настоящее время. Занимался разработкой банковских микросервисов, проектированием и разработкой распределенной системы автоматизации управления почтовыми рассылками, разработкой сервиса обработки и хранения почтовых вложений, разработкой сервиса отправки почтовых рассылок на основе приоритетов, разработкой сервиса централизованного управления системой автоматизации управления почтовыми рассылками, реализацией обработки записей из Kafka на основе приоритетов, разработкой подключаемого модуля авторизации, повышением отказоустойчивости системы, разработкой модульных и интеграционных тестов, конфигурацией сборки, доставки и развертывания артефактов.\n\nИмеет опыт работы с Java, Spring Framework (Boot, Cloud), Vaadin, JPA, Failsafe, Mapstruct, Liquibase, Swagger, JUnit, EasyRandom, Mockito, Testcontainers, WireMock, Maven, Gradle, Oracle DB, PostgreSQL, S3 Minio, Kafka, GitLab CI/CD, Nexus, Docker, Kubernetes, Git, REST.\n\nТакже работал над разработкой банковских систем для ВТБ,  и Росгосстрах, разработкой сервиса оркестрации бизнес-процессов на основе Camunda, разработкой комплексной логики сервиса маршрутизации запросов с учетом глобальных параметров, статуса миграции отдельных модулей и метаинформации запроса, разработкой механизма контекстно-зависимой валидации данных для удовлетворения бизнес-требованиям заказчика, разработкой сервисов интеграции с системами заказчика, реализацией синхронизации взаимодействия через брокеров сообщений, разработкой и интеграцией системы аутентификации и авторизации на основе Keycloak, разработкой модульных и интеграционных тестов, конфигурацией сборки, доставки и развертывания артефактов в контуре заказчика, работой с большим количеством внутрибанковских библиотек для логирования, сборки/отправки/хранения логов, мониторинга, аудита и т.д.\n\nИмеет опыт работы с Java, Kotlin, Spring Boot, Camunda, Keycloak, JPA, JMS, Mapstruct, Quartz, Flyway, Swagger, JUnit, EasyRandom, Mockito, MockK, Testcontainers, WireMock, Maven, Gradle, PostgreSQL, Redis, Kafka, IBM MQ, ActiveMQ, TeamCity, Bamboo, Nexus, Docker, Kubernetes, Git, REST.\n\nТакже имеет опыт разработки модулей монолитной медицинской информационной системы, оптимизации существующего кода и работы с БД, поиска и устранения проблем в безопасности приложения.", "Период работы 2021-08-01 - 2023-01-01 на позиции Программист-разработчик.\n\n- Реализация автоматических проверок новых заявителей перед выдачей им займов.\n- Реализация новых микросервисов, включая сервис доставки документов и сервис-бот для проверки скоринговых параметров заявителей.\n- Реализация механизмов уведомлений пользователей через PUSH и Email.\n- Работа с РосРеестром, включая разработку электронных закладных и отправку их, а также создание человекочитаемого формата закладных для предварительной сверки документов перед отправкой.\n- Реализация новых видов документооборота с РосРеестром.\n- Реализация взаимодействия с ТСБ и создание соответствующих XML документов.\n- Реализация многочисленных постбеков.\n- Работа над автоматизацией создания новых документов.\n- Поддержка работы с ФССП и ЗЧБ.\n\nТехнологии: Java 17, Spring Boot, Spring Security, Spring MVC, Spring WebFlux, MongoDB, ClickHouse, RabbitMQ, Kibana, KeyClock, MapStruct, Lombok.\n\nПериод работы 2020-10-01 - 2021-07-01 на позиции Software Developer.\n\n- Разработка первоначальной конфигурации проекта, реализация моделей будущего проекта, проектирование и создание API, настройка работы базы данных, реализация механизмов удаления PII данных, создание механизмов миграций данных со сторонних сервисов, создание механизма аудита средствами Javers-a, реализация механизма нотификации пользователей по средством email рассылки, работа над swagger-ом для пользователей нашей системы, исправление багов, написание тестов.\n\nТехнологии: Java 11, Spring Boot, Spring Jpa, PostgreSQL, Spring Security, Spring MVC, Hibernate, Kafka, MapStruct, Lombok, Docker, JUnit 5.\n\nПериод работы 2018-07-01 - 2020-10-01 на позиции Software Developer.\n\n- Участие в разработке и поддержке сайта для создания и управления высоконагруженными системами основанными на Sip протоколе.\n- Участие в создании внутреннего сервиса для группы поддержки, который позволяет контролировать качество связи, строить различные типы графиков и получать данные о звонках.\n- Участие в разработке основного функционала проекта, который велся на языке Go.\n- Участие в разработке иностранного ресурса, направленного на безопасность, который помогает владельцам выстроить шаблоны поведения в различных ситуациях и автоматизировать работу систем безопасности.\n- Работа над функционалом для отображения страниц статусов компаний-клиентов, построение различных графиков, возможности экспорта данных, создание отдельного микросервиса для отображения API, удобное компанование данных и возможность легкого ориентирования во всех возможностях проекта.\n\nТехнологии: Java 8, Spring, Hibernate, Postgres, Play Framework, Go, TypeScript, Kotlin, Angular, GraphQl, Spring, Hibernate, PostgreSQL, MariaDB, RabbitMQ, GraphQL.", "Период работы 2021-11-28 - None на позиции Senior java developer.\nРазработка новой платформы для дистанционного банковского обслуживания.\nРазработка новых функций и исправлений ошибок.\nПроведение проверки кода.\nПокрытие кода модульными тестами.\nПроведение интервью.\nРефакторинг.\nРазработка архитектуры и модели данных для новых микросервисов.\nРабота с микросервисами.\nРабота с аналитикой.\nАктивное взаимодействие со связанными командами.\nУчастие в демонстрации продукта бизнес-заказчику.\nПоддержка Prod.\nТехнологии и навыки: Java, Spring Framework (Boot, MVC, Data, Security), Hibernate, PostgreSQL, JUnit, Mockito, Gradle, Apache Tomcat, Nginx, Git, HazelCast, Liquibase, Docker, Микросервисная архитектура, IBM MQ.\n\nПериод работы 2020-11-28 - 2021-11-28 на позиции Java developer.\nРазработка нового функционала, проведение code review, покрытие кода unit-тестами, проектировка сущностей базы данных, рефакторинг legacy кода, проектировка REST api, составление технической документации, активное взаимодействие со смежными командами, участие в демонстрации продукта бизнесс-заказчику.\nСтек: Java; Spring Framework (Boot, MVC, Data, Security); Hibernate; MyBatis; PostgreSQL; ClickHouse; MongoDB; JUnit; Mockito; Mave; Gradle; Apache Tomcat; Git; SVN; RestApi; ActiveMQ.\n\nПериод работы 2020-01-28 - 2020-11-28 на позиции java developer.\nРазработка систем управления содержимым компаний.\nРазработка нового функционала, покрытие кода unit-тестами, проектировка сущностей базы данных, участие в демонстрации продукта, участие в написание view части приложение (frontend) на JSP, поддержка и сопровождение старого функционала.\nСтек: Java, Hibernate, JPA, JUnit, Mockito, Maven, Ant, Tomcat.\n\nПериод работы 2019-02-07 - 2020-01-07 на позиции Java Developer.\nИспользуемый стек технологий: Java, Spring Framework, Spring Boot, Hibernate, JPA, JUnit, Mockito, Tomcat.", "Ключевые достижения:\n\n1. Разработка микросервисной архитектуры приложения на Java, Kafka, Protobuf, gRPC, Spring, Docker, Istio, Kubernetes, HELM.\n2. Разработка Java приложений для медицинских организаций, включая ReactJS, Spring, Hibernate, BackboneJS, DustJS, PostgreSQL.\n3. Участие в разработке фреймворка, упрощающего создание новых модулей в сложных бизнес-приложениях.\n4. Работа над поддержкой проектов в области логистики, включая разработку программного обеспечения, работу с базами данных Oracle SQL, Delphi, Bash, Perl, CrystalReports.", "Ключевые достижения:\n\n1. Разработка и поддержка двух проектов в области программного обеспечения.\n2. Работа с различными стеками технологий, включая Java 8, Spring framework, Kafka, Cayene, Microservice architecture, PostreSQL, Docker, Swagger, JUnit, Slf4j, Maven, Gitt.\n3. Участие в разработке сервиса/портала по мероприятиям и событиям, предназначенного для создания мероприятий/событий по интересам для клиентов сервиса.\n4. Разработка внутренней инфраструктуры веб-приложения, микросервисов, API для фронтовой части, таблиц для базы данных, а также поддержка существующего кода.\n5. Интеграция сервисов и разработка вебсервисов на основе spring-ws для интеграций между системами.\n6. Реализация back-end для клиентского сервиса, частичной реализации front-end, системы рассылки оповещений, разработки рест-контроллеров, модульных и интеграционных тестов, модуля статистики, модуля создания мероприятий, бизнес слоев, клиентских слоев, написания SQL-запросов, рефакторинга кода и bug-fixing.", "Опыт работы:\n- Разработка приложения gosuslugi.ru: Государственный сервис для взаимодействия юридических лиц с проверяющими органами - разработка приложения - JUnit Testing, Integration Tests, Mockito - Agile, SCRUM (Atlassian Jira)\n- Разработка приложения: Музыкальный стриминговый сервис Потоковая передача данных с помощью веб-службы Spring Boot RESTful с использованием Spring WebFlux Reactive на неблокирующих вызовах. - Принимал участие во всех этапах разработки приложения - Код-ревью -  ирование JUnit, Интеграционные тесты, Mockito - Работа со сторонними API (Liquibase, Swagger, Logger Slf4j) - Разработка по методологии Agile, Kanban (Atlassian Jira)\n- Java 11, Spring boot WebFlux, Spring Security WebFlux, Spring Data R2DBC, PostgresSQL, Swagger, Lombok, Docker, Git, JUnit, Mockito, Liquibase\n- Java 11, Spring WebMVC, Spring-Web, Hibernate, Spring Security, MySQL, Unit. Разработка онлайн-магазина. Реализация JUnit тестов. Реализация новые функций. Интеграция с МойСклад, со службой доставки СДЭК. Настройка и наполнение базы данных MySQL. Настройка Spring Security для обеспечения аутентификации и авторизации пользователей в личном кабинете.", "Ключевые достижения:\n\n1. Участие в разработке новой системы, состоящей из более чем 5 микросервисов, связанных с банковскими переводами и ошибками.\n2. Написание кода для микросервисов, библиотек и других компонентов системы.\n3. Багфиксинг и участие в обсуждении задач с командой разработчиков.\n4. Общение с аналитиками для уточнения требований к системе.\n5. Использование стека технологий, включающего Spring boot, Hibernate, Postgres, Liquibase, OpenAPI (Swagger), OpenShift, Docker.\n\n6. Разработка и поддержка внутренней корпоративной системы, включая личный кабинет работника, систему обучения, обработку инцидентов и техническую поддержку пользователей.\n7. Разработка нового функционала для корпоративной системы.\n8. Тестирование системы и поиск и исправление багов.\n9. Предоставление технических консультаций пользователям и коллегам.\n10. Использование стека технологий, включающего монолитную архитектуру, Java 8, Spring 5+ (web, security), JPA/Hibernate, MySQL, JUnit, Maven, Git - Bitbucket, Lombok, Swagger (OpenAPI).", "Ключевые достижения:\n\n1. Полностью сделана под ключ задача интеграции со сторонним сервисом, что позволило обеспечить процесс выплат и управление продажами.\n2. Решена проблема загрузки большого объема данных, что увеличило производительность в 10 раз.\n3. Реализована загрузка реестров.\n4. Полностью переделан алгоритм валидации версий документации проектировщиков, увеличена производительность в 8 раз и надежность.\n5. Реализован планировщик задач проектировщиков.\n6. Разработка нового функционала, доработка существующего, поиск и устранение багов в бэкенд части PLM системы, которая внедрена на проекте строительства АЭС Ханхикиви-1 в Финляндии.\n7. Ведение проектов по внедрению кассовых систем и прочих IT проектов.\n8. Поддержка мобильных приложений компании.\n9. Администрирование Active Directory.\n10. Настройка кассовых систем IS, R-keeper, iiko.\n11. Внедрение новых технических корпоративных решений.\n12. Создание Web-отчетов на базе php, HTML, SQL.\n13. Разработка инструкций, технических заданий и документации.\n14. Анализ и выявление системных ошибок, поиск решений.\n15. Коммуникация с иностранными отделами компании.\n16. Контроль и корректировка действий сервисных компаний.\n17. Администрирование операционных систем Windows 7, 8, 10 и пакета Microsoft OFFICE.\n18. Первая линия поддержки всех типов пользователей.\n19. Регистрация заявок пользователей.", "Ключевые достижения:\n- Опыт работы в роли Team Lead Java разработчика;\n- Успешный перевод проекта с использованием устаревших технологий на современные;\n- Разработка и доработка проектов в различных стеках технологий;\n- Опыт работы в команде по методологии agile.", "Резюме содержит опыт работы в качестве Java Developer в течение двух лет. В первый период работы (сентябрь 2021 года по ноябрь 2022 года) специалист занимался разработкой сервисов для самозанятых, созданием API для интеграции внешних сервисов, а также работал над микросервисной архитектурой и покрытием кода тестами. Во второй период (ноябрь 2019 года по август 2021 года) он участвовал в разработке комплексного решения для трейдеров, включая добавление новых эндпоинтов, поддержку старых, проектирование моделей данных и БД, написание SQL запросов и Unit-тестов. Технологический стек включает Java 8/11, Camunda bpm, Hibernate ORM, Spring boot, OracleDB, Maven, Swagger, Junit 5, Spring Cloud, Bitbucket, Liquibase.", "Ключевые достижения:\n- Опыт работы в разработке программного обеспечения более 3 лет.\n- Знание и опыт работы с языками программирования Java, Java Spring Framework, SQL, Git, PostgreSQL, Swagger, MyBatis, Spring Boot, Apache Kafka, Gradle, Docker.\n- Участие в разработке крупных проектов, таких как московские электронные школы и CRM-система организации.\n- Опыт работы с различными технологиями и инструментами, включая JavaFX, Microsoft SQL Server, C, Arduino.\n- Умение работать в команде, проводить код-ревью и участвовать в ежедневных встречах.", "Ключевые достижения:\n- Доработка биллинговой системы и разделение монолитной системы на сервисы.\n- Проект интеграции с провайдером телекоммуникационных услуг \"BICS\".\n- Доработка сервисов решения для дистанционного банковского обслуживания малого и среднего бизнеса и физических лиц.\n- Разработка микросервисов хранения, взаимодействия с интеграционной шиной банка и front-end для проекта дистанционного банковского обслуживания физических лиц.\n- Разработка Zeebe экспортера для мониторинга процессов в проекте автоматизации бизнес-процессов на основе фреймворка Zeebe.\n- Реализация вызова сервиса данных HeadHunter в проекте розничного кредитного конвейера банка из Топ-20.\n- Проект интеграции с сервисом Refinitiv для биржи.", "В период с 2020 по 2020 год работал в должности Team/Tech Lead, Senior Software Engineer. Занимался управлением разработкой новых микросервисов и кроссфункциональной командой из 10 человек. Использовал стек технологий: Java 11, Kotlin, Spring Boot, Maven, JOOQ, Postgres, OpenShift, Istio, Jenkins.\n\nВ период с 2019 по 2020 год работал на позиции Senior Java Software Engineer. Разрабатывал и внедрял новые продукты для проекта СББОЛ. Использовал следующие технологии: Java 8, Spring Framework (IoC, MVC, AOP, Transaction), Hibernate, JOOQ, Oracle, Gradle, Git.\n\nВ период с 2017 по 2019 год работал на позиции Senior Java Software Engineer. Разрабатывал новые проекты для платформы ЕФС. Использовал следующие технологии: Java 7, Java EE (Servlets, JNDI, JMS, JAX-RS), Spring Framework (IoC, MVC, AOP), JUnit, Mockito, Git.\n\nВ период с 2016 по 2017 год работал на позиции Java Middle Developer. Разрабатывал бэк-офисные системы. Использовал следующие технологии: Java Core 7, Spring Framework (IoC, MVC), JAX-RS, Maven, Git, JUnit, Mockito.\n\nВ период с 2015 по 2016 год работал на позиции Java Developer. Разрабатывал и внедрял продукты IDempiere и Liferay. Использовал следующие технологии: Java Core 7, Java EE (Servlets, Portlets, JAX-RS), OSGI Framework, Postgres.", "Период работы 2022-04-01 - None на позиции Java/Kotlin Developer.\nОпыт работы: Работа над приложением \"Инвестиции\". Участие в разработке архитектуры бекенда, декомпозиции фичей на технические задачи, выборе реализации и реализации бизнес-фич. Реализация единого флоу открытия брокерского счёта и ПИФ, вывода валюты с брокерского счёта, интеграции с банковской системой карт и счетов. Работа с протоколом и шлюзом Plaza2 для связи с торговой системой Spectra Московской биржи и реализация интеграции для срочного рынка. Интеграции с другими системами через кафку, gRPC. Участие в принятии решений для всего бекенда стрима. Использование Kotlin в команде и интерес к его использованию в соседних командах. Внедрение иннерсорса. Участие в инфраструктурных работах, доработка CI/CD пайплайнов. Участие в архитектурном кружке. Собеседование других разработчиков. Выращивание стажёра, который был принят в штат. Стек: Kotlin, Java 15, 17, Spring Boot, gRPC, Kafka, Postgres, K8s, Istio, Redis, Testcontainers, ELK, Gradle, Gitlab.\n\nПериод работы 2019-01-01 - 2022-04-01 на позиции Java/Kotlin Developer.\nОпыт работы: Разработка микросервисов для команд Поиска и Персонализации в мобильном приложении \"банк Онлайн\" на Java. Переход на Kotlin для создания модулярного монолита. Участие в создании архитектурных решений и проектировании высоконагруженной отказоустойчивой системы. Внедрение реактивного стека, R2DBC, Circuit Breaker, Rate Limiter, нагрузочное тестирование с помощью Gatling, написание на Scala. Интеграция с другими командами банка по REST с mTLS и через Kafka. Оптимизация запросов к БД. Реализация полнотекстового поиска в Postgres с помощью ts_vector. Проба внедрения Debezium. Создание нового CI/CD пайплайна на декларативном синтаксисе Jenkins. Внедрение Istio для нашего кластера, реализация Canary Deployment. Реализация бизнес-задач, участие в релизах. Обучение стажёров. Стек: Kotlin, Java 11, Spring Boot, WebFlux, R2DBC, Kafka, Ignite, Docker, Postgres, Openshift, Jenkins, Gatling, JMeter, Gradle, Hadoop, Spark (scala), Oozie.\n\nПериод работы 2018-09-01 - 2018-11-01 на позиции Senior PL/SQL Developer.\nОпыт работы: Разработка и поддержка проекта хранилища данных. Разработка на XML.\n\nПериод работы 2015-04-01 - 2018-09-01 на позиции Senior PL/SQL Developer.\nОпыт работы: Работа на стороне разработчика-интегратора CRM и биллинг систем для телекома, платных дорог. Участие в проекте внедрения единой CRM системы федерального телеком оператора в качестве ведущего разработчика. Разработка архитектуры и реализация клиентского workflow, каталога продуктов, модуля разделения полномочий, интеграций с собственной биллинг-системой, СЛТУ, Аргус, OTT, MVNO, 1С УТ. Управление группой разработки и поддержки, проведение code review, обучение стажёров. Участие в проекте внедрения CRM системы оператора платных дорог в качестве разработчика. Разработка архитектуры и реализация бизнес-процессов, модуля управления запасами, техническая поддержка.\n\nПериод работы 2013-11-01 - 2015-03-01 на позиции C++ Developer.\nОпыт работы: Разработка и поддержка системы информационного обеспечения управленческих решений в учреждениях дошкольного образования (ДОУ) в роли ведущего разработчика. Расширение функционала приложения, рефакторинг, техническая поддержка. Разработка и обслуживание систем государственно-общественного управления учреждением профессионального образования (СПО) в роли разработчика. Расширение функционала приложения.", "В период с 2020 по 2020 год работал на позиции Главного инженера по разработке. Занимался разработкой приложения для продажи продуктов экосистемы банка через сеть банка и партнеров, а также для тестирования методик продаж. Успешно перешел с языка программирования Java на Kotlin. Выполнил ряд интеграций с сервисами банка, включая отправку push-сообщений, авторизацию клиентов по сберID и персональные предложения для клиентов. Также занимался написанием запросов и оптимизацией существующих запросов, интеграцией с внешними API, использованием языков программирования Kotlin, Java, Spring Boot, PostgreSQL, Redis, Junit, Hibernate, Git, Apache Kafka, ELK Stack.", "Ключевые достижения:\n\n1. Разработка микросервисного сервиса witsml-service на позиции ведущего инженера-программиста.\n2. Реализация проектов доработки backend части банковской АБС на позиции программиста бэкэнд PL/SQL / Java developer.\n3. Разработка собственных игр и игр на заказ, а также разработка агрегатора Java вакансий.\n4. Разработка ПО для рынка форекс с использованием нейронных сетей.\n5. Реализация проектов криптографии для blockchain технологий.\n6. Выявление и устранение ошибок мобильного кошелька, реализация проекта восстановления системы.", "Работал на позиции Senior Backend Developer с 2020 года. Занимался разработкой и поддержкой продуктов компании, связанных с рассылкой клиентских сообщений. Реализовывал интеграции с различными системами заказчиков. Использовал языки программирования Java, Spring, Oracle/PostgreSQL/MsSQL, Kafka, RabbitMQ, Docker, WebSocket, gRPC, GitLab CI/CD, Maven.\n\nРаботал на позиции Java Developer с 2016 года. Участвовал в создании и запуске в релиз серверной части мобильного приложения ФК Спартак. Развивал веб-интерфейс для управления контентом сайта. В дальнейшем перешёл в команду проекта Столото. Создал сервис интеграции с SAP CRM и провайдера OAuth для дочерних сайтов. Использовал языки программирования Java, Spring, PostgreSQL, JPA (Hibernate), Redis, InfluxDB, Graphite, ElasticSearch, Solr, ZooKeeper, Kafka, RabbitMQ, Docker (Rancher), GitLab CI/CD, Maven.", "Ключевые достижения:\n- Опыт работы в качестве старшего Java-разработчика, включая микросервисную архитектуру и разработку на стеке фреймворков Spring, Kafka, Hibernate, Junit, JWT, ActiveMQ, Maven, Gradle.\n- Участие в проектах по разработке микросервисных систем для автоматизации контроля эффективности команд, оценки работы команд в спринтах и интеграции между кредитным front и back офисами.\n- Опыт работы с инструментами IntelliJ Idea, Tomcat, Jenkins, SonarQube, Postman, DBeaver, GitLab, SoapUI, Talend Open Studio, Docker, Jira, Confluence.\n- Опыт разработки на Scala для проекта кредитного бюро по конвертации загруженных от клиентов файлов в типизированный формат организации.\n- Опыт работы в качестве ведущего разработчика отдела внедрения, включая разработку нового функционала на базе платформы 1С, обучение клиентов и сотрудников, а также менторство.", "Ключевые достижения:\n- Реализация логики разбора параметров http-запроса в спецификацию jpa.\n- Разработка основной части кода обработки xml-документов.\n- Разработка основной многопоточной части приложения для сбора и обработки информации с приборов учета электроэнергии.", "Опыт работы:\n- Java-разработчик в компании, занимающейся разработкой программ лояльности для компаний и заведений.\n- Работа над новым функционалом и доработка существующего.\n- Разработка новых модулей проекта.\n- Коммуникация с разработчиками команды и других отделов.\n- Технический стек: Spring (Boot, Data, WebFlux), Oracle DB, Java 17.", "Ключевые достижения:\n\n1. Разработка нового функционала для SPA приложений.\n2. Проектирование и создание архитектуры программного обеспечения.\n3. Разработка и отладка программного кода, контроль документации.\n4. Участие в разработке клиент-серверных, распределенных, событийно-ориентированных архитектур и микросервисов.\n5. Использование технологий Java, Spring Boot, PostgreSQL, MongoDB, Docker.\n6. Участие в разработке банковской системы.\n7. Разработка развлекательного мобильного приложения для пользователей Megacom.\n8. Участие в запуске сервисов, мобильных и веб-приложений, настройке платежных и транзакционных шлюзов, развертывании облачной инфраструктуры, работе с Большими Данными.\n9. Участие в полном цикле разработки программного обеспечения (кодирование, тестирование, внедрение и поддержка).\n10. Разработка клиентских и серверных приложений.\n11. Поддержка и развитие существующего программного обеспечения.\n12. Разработка распределенных, высоконагруженных и отказоустойчивых систем.\n13. Проектирование инфраструктуры серверов и услуг.\n14. Оптимизация и поддержка структуры на всех этапах цикла.\n15. Консультация и поддержка партнеров.\n16. Программирование на языках Java, Python, Django.", "Ключевые достижения:\n- Опыт работы в роли Backend Tech Lead, Senior Kotlin Backend Developer и Java Developer.\n- Успешная интеграция новых членов команды в процесс разработки.\n- Поддержка высокого уровня качества кода посредством проверки кода.\n- Внедрение новых функций в NFT marketplace.\n- Оптимизация существующих функций и разработка новых на NFT marketplace.\n- Разработка и внедрение API системы дистанционного банковского обслуживания на микросервисной архитектуре.\n- Реализация прототипа мультивалютного кошелька с несколькими подписями (BTC, ETH).\n- Внедрение новых функций и поддержка CRM-продукта для микрофинансовой компании.\n- Интеграция с внешней службой телефонной связи.", "Ключевые достижения:\n- Опыт работы с различными стеками технологий, включая Java, Spring, Hibernate, Kotlin, PostgreSQL, Oracle, Maven, Rabbit MQ, Kafka, Gitlab, Jenkins, Kubernetes, Docker.\n- Опыт разработки серверной части платежного шлюза, микросервисов, рефакторинга монолитных приложений.\n- Опыт создания нового сервиса предварительно рассчитанных правил для торговых операций, разработки API для взаимодействия с клиентами сервиса, проектирования таблиц базы данных, модульного тестирования, развертывания и проверки кода.\n- Опыт разработки серверной части мобильного приложения банка и веб-клиента, улучшения и развития сервиса истории операций пользователя, сервиса аутентификации, сервиса пользовательских отчетов и т.д.\n- Опыт технического обслуживания и внедрения новых функций в систему персонального кредитного конвейера, создания новых сервисов с использованием Java/Kotlin + Spring Boot, рефакторинга устаревшего кода, интеграции с банковскими системами.\n- Опыт построения CRM-системы Siebel в соответствии с требованиями, создания интеграции CRM с банковскими системами, создания отчетов P.", "Ключевые достижения:\n- Разработка и упрощение интеграции коммуникационной инфраструктуры центра обработки данных.\n- Разработка распределенной системы кэширования на основе модели обмена сообщениями pub/sub со скоростью 1000 rps.\n- Внедрение Apache Kafka с точки зрения серверной части и улучшение производительности обработчиков API.\n- Перенос функций в микросервисную архитектуру.\n- Выполнение задач, связанных с аутентификацией и авторизацией.\n- Создание развернутого веб-приложения для оценки поиска информации в личных службах.\n- Развертывание веб-службы как части среды тестирования электронной почты.\n- Анализ данных и улучшение инфраструктуры.\n- Поставка приложения и сервера для обработки видео в реальном времени и потоковой передачи с камеры Android-смартфона.\n- Поставка настольного приложения с пользовательским DRM, включающим инструменты для статистического анализа изображений с микроскопа.", "Резюме опыта работы:\n\n1. Java Developer (2022-11-01 - None): Разработка и поддержка микросервисов на Java, поддержка скриптов деплоя в k8s.\n2. Lead Java Developer (2019-01-01 - 2022-11-14): Разработка и поддержка микросервисов на Java 8 / Kotlin, интеграция со службами/микросервисами через REST, Kafka, SOAP, XML.\n3. Senior Java Developer (2018-10-01 - 2019-12-01): Разработка и поддержка микросервисов на Java 8 с помощью Spring Boot 1, интеграция с сервисами/микросервисами через REST, MQ, SOAP, развертывание микросервисов в виде fat-jar на серверах Linux и контейнерах в Openshift, поддержка микросервисной инфраструктуры.\n4. Java Developer (2014-10-01 - 2018-10-01): Разработка и поддержка приложения монолит на Java 7, интеграция с Liferay, поддержка офисной инфраструктуры ПО: windows 7.\n\nКлючевые достижения:\n\n1. Разработка и поддержка микросервисов на Java, Kubernetes, Spring Boot, Kotlin.\n2. Разработка и поддержка микросервисов на Java 8 / Kotlin, интеграция со службами/микросервисами через REST, Kafka, SOAP, XML.\n3. Разработка и поддержка микросервисов на Java 8 с помощью Spring Boot 1, интеграция с сервисами/микросервисами через REST, MQ, SOAP, развертывание микросервисов в виде fat-jar на серверах Linux и контейнерах в Openshift, поддержка микросервисной инфраструктуры.\n4. Разработка и поддержка приложения монолит на Java 7, интеграция с Liferay, поддержка офисной инфраструктуры ПО: windows 7.", "Ключевые достижения:\n- Внедрение общих стандартов использования БД, апи и других технологий;\n- Внедрение самописного мониторинга на тестовых стендах;\n- Сокращение технического долга собственного сервиса - истории операций пользователя;\n- Создание минималистичной модели истории операций, что позволяет подключать новых поставщиков в разы быстрее;\n- Инициация автоматизации отчетов о пользовательских данных;\n- Сокращение времени выполнения тестов мониторинга и интеграции;\n- Снижение сложности реактивного кода;\n- Формализация модели операций с историей;\n- Реализация доставки операций с историей с нуля;\n- Способствование карьерному росту членов команды;\n- Внедрение нескольких бизнес-функций с нуля;\n- Консолидация архитектуры микросервисов;\n- Улучшение стабильности сервисов с помощью тестов API и мониторинга;\n- Выстраивание командных процессов;\n- Реализация основных игровых механик с нуля;\n- Унификация процессов выдачи контента;\n- Заметное уменьшение технического долга, что привело к снижению нагрузки на процессор.", "Период работы 2023-11-01 - 2024-01-06 на позиции Java разработчик.\nОпыт работы:\n- Разработка нового функционала для программы лояльности, включая кэшбэки.\n- Использование стека технологий: Java 17, Spring Boot 2.7, Spring MVC, Spring Data, Kafka, RabbitMQ, MSSQL, PostgreSQL, Hibernate, Liquibase, REST.\n\nПериод работы 2021-03-01 - 2023-10-06 на позиции Java developer.\nОпыт работы:\n- Разработка нового функционала для продукта, использующегося профессиональными участниками фондового рынка.\n- Вынесение функционала в отдельные микросервисы.\n- Получение и обработка данных с внешних порталов, написание интеграций.\n- Работа с БД (ms sql).\n- Создание сущностей БД, ДТО, сервисов, джобов, планировщиков и т.д.\n\nПериод работы 2020-02-01 - 2021-03-01 на позиции Специалист по разработке ПО.\nОпыт работы:\n- Разработка нового коробочного продукта в экосистеме крупного российского банка.\n- Планирование задач разработки на квартал вперед.\n- Написание интеграционных взаимодействий между бэкендом и страховыми сервисами, работа с интеграцией платежных сервисов.\n- Взаимодействие с frontend, утверждение и обсуждение реализации с Android, iOS разработчиками, дизайнерами, создание, доработка мобильных виджетов, создание стратегий и ДТО со стороны бэкенда.\n- Реализация последовательности шагов процесса, в рамках которых подключались спринг - контексты и переиспользовались уже созданные API, а, так же, добавлялись собственные реализации.\n- Работа с конфигурационными файлами.\n- Тестирование нескольких отдельных функциональных подсистем.\n- Доработка и правка аналитики: в основном бэкенда, но, так же и отдельных моментов \"фронта\".\n- Взаимодействие со смежными подсистемами, установление договоренностей, создание заявок и т.п.\n- Исправление багов.\n- Ведение jira.\n- Написание unit-тестов.\n\nПериод работы 2019-02-01 - 2020-02-01 на позиции Младший инженер-программист.\nОпыт работы:\n- Написание бизнес-логики.\n- Разработка GUI.\n- Написание многоуровневых CRUD (sql) - запросов для указанных БД.\n- Модификация различных фильтров посредством java-логики, hibernate queries.\n- Работа с ORM, изменение сущностей.\n- Построение отчетов в Birt (и, соответственно работа с Tomcat - для их просмотра).\n- Code-review.\n- Модификация структуры БД (liquibase).\nДостижения:\n- Научился писать понятный, эффективный код и впитал тягу к тому, чтобы он был максимально оптимизирован.\n- Поставил рекорд по скорости создания отчета.\n- Оптимизировал запрос в БД из 2000 строк + сократил его до 600.\n- Предложил вариант реализации и выполнил на нём поставленную задачу.", "Резюме кандидата включает опыт работы в роли Lead Software Engineer и Senior Java Backend Developer. В обоих случаях он занимался разработкой высоконагруженных систем и микросервисов. Он имеет большой опыт работы с Java 11, Spring Framework, Web Flux, Hibernate Orm, Docker, PostgreSQL, Redis, Kafka, Openshift, Couchbase, Kubernetes. Он также обладает навыками в области системной интеграции, разработки программного обеспечения и проведения код ревью.", "Ключевые достижения:\n\n1. Разработка микросервисов на Spring Boot.\n2. Работа над сервисом передачи координат курьера и его отображения на карте клиента.\n3. Работа над сервисом интеграции с keycloak.\n4. Работа над сервисом внутреннего документооборота.\n5. Работа над сервисом поточного сканирования документов.\n6. Code review.\n7. Переход на новые версии Java.\n\nВ период работы на позиции ведущего программиста были достигнуты следующие результаты:\n\n1. Создание оркестратора для управления ETL-инструментами.\n2. Расширение и доработка функций SQL.\n3. Создание API для конфигурации оркестратора.\n4. Создание REST-API для отображения информации в UI.\n5. Исправление существующих багов.\n6. Поддержка пользователей.\n7. Планирование работ на спринт, контроль выполнения работ, обучение младших коллег.\n8. Участие в митингах, встречах с начальством и пользователями.", "Ключевые достижения:\n- Опыт работы с банковским проектом, включая плановый перевыпуск зарплатных карт и эмиссию карт, настройку метрик и реализацию интеграций с различными сторонними сервисами.\n- Разработка нового функционала системы, покрытие его тестами, принятие архитектурных решений, ревью кода.\n- Работа в проекте кибербезопасности, написание нового функционала, включая новые пути выдачи пользовательских сертификатов безопасности, осуществление интеграций с различными системами входящими в инфраструктуру.\n- Участие в нагрузочном тестировании и решение возникших ошибок.\n- Опыт работы с Java-разработкой, включая заведение новых клиентов, их редактирование, хранение данных о клиентах компании, работу с договорами, регистрацию договоров, подсчет оплаченных средств клиентами, вычет разницы по излишне уплаченным средствам, либо доплата в случае если метраж квартиры увеличился, так же система хранила в себе записи на осмотр помещений и исходя из статуса осмотра – выдавала необходимые шаблоны документов для подписания, интегрировалась с 1С бухгалтерией компании, на основе чего высылала счета на оплату клиентам, интегрировалась с банками на этапах подписания договора купли помещений, интегрировалась с Контуром для проверки благонадежности контрагентов, выгружала и направляла по подразделениям регулярные отчеты в зависимости от необходимости.", "Резюме содержит информацию о двух периодах работы. В первом периоде (2020-10-01 - 2022-10-03) человек работал на позиции Software Engineer. Он занимался разработкой и поддержкой интеграционных микросервисов, покрытием кода тестами, развертыванием сервисов на контурах, работами по перформансу и рефакторингом кода. В результате были достигнуты следующие успехи: разработан сервис со Swagger API по конфигурации заглушек для автотестирования, внедрена практика покрытия и статического анализа кода, исправлены баги, связанные с безопасностью и утечкой потоков, доработаны и покрыты тестами сервисы, отвечающие за логгирование, улучшены процессы разработки.\n\nВо втором периоде (2014-08-01 - 2020-10-01) человек работал на позиции Java Developer. Он занимался разработкой и поддержкой продуктов группы СНГ, анализом архитектуры приложений, оценкой трудозатрат, поддержкой клиентов в разворачивании и эксплуатации продуктов, документированием и рефакторингом разрабатываемых продуктов. В результате были достигнуты следующие успехи: разработка архитектуры приложения по проверке карт, находящихся в черном списке, миграция данных со старой версии интернет-банкинга на новый, разработка приложения по онбордингу физ. Лиц, разработка интеграции между локальными системами и АБС для осуществления переводов, разработка приложения по генерации и печати PIN-конвертов, внедрение функциональности 3D-Secure по локальным картам банка, реализация гео-ограничений для клиентов интернет и мобильного банкингов, поддержка read-only базы для веб-приложения, реализация 2-х факторной аутентификации для входа в личный кабинет.", "Ключевые достижения:\n\n1. Разработка ПО в соответствии с корпоративными стандартами архитектуры.\n2. Участие в разработке проекта сервиса аутентификации, реализация фич в соответствии с ТЗ.\n3. Участие в разработке внутренней системы документооборота и системы распознавания qr- и штрих-кодов.\n4. Организация и сопровождение проектов по созданию и реализации систем АСУ ТП для АЭС.\n5. Менеджмент проектов.\n6. Проектирование и разработка оборудования АСУ ТП для АЭС.", "Ключевые достижения:\n- Опыт разработки и поддержки сервиса, который получает данные по API внешних поставщиков и перенаправляет их в контур банка.\n- Участие в разработке Jenkins пайплайна.\n- Разработка backend сервисов для пользовательского интерфейса системы мониторинга.\n- Реализация frontend и backend части сервиса, а также печатной формы с использованием библиотеки JasperReports и Elasticsearch.", "Ключевые достижения:\n- Опыт работы в IT-сфере более 15 лет\n- Руководство IT-департаментом и IT-направлением\n- Разработка стратегии и тактики развития компании в IT-сфере\n- Проектирование и организация IT-инфраструктуры компании\n- Участие в формировании проектной, технической документации и внутренних регламентов\n- Участие в формировании политики информационной безопасности, других IT-политик\n- Руководство группой разработчиков\n- Участие в создании ПС X-Plat (MSSQL+C#\\Delphi)\n- Подключение Поставщиков услуг к процессингу X-Plat(C#\\Delphi)\n- Администрирование СУБД MSSQL, написание приложений на C# и запросов для MSSQL", "Ключевые достижения:\n- Опыт работы в качестве ведущего разработчика и Java-разработчика;\n- Работа с микросервисной архитектурой, Java, Kotlin, Spring Boot, Postgresql, MapStruct, Spring Data + Hibernate и другими технологиями;\n- Участие в проектах различной сложности, включая разработку с нуля до прода, поддержку и рефакторинг кода;\n- Опыт выстраивания процессов разработки в команде, коррекции системных и бизнес требований;\n- Работа с различными инструментами и платформами, такими как Bitbucket, Jira, OpenShift, Конфа;\n- Опыт менторинга младших сотрудников и проведения технических интервью в компанию.", "Ключевые достижения:\n\n1. Опыт работы в роли Senior Java Developer, участие в разработке новых функций и фич, покрытие кода тестами, багфикс и code review.\n2. Опыт работы в роли Java Developer, участие в разработке новых функций и компонентов, работа со Spring MVC, Swagger, YAML, Spring Boot, микросервисами, Hibernate, Liquibase, PostgreSQL, Maven, Kafka, ELK stack, JUnit, Mockito, Docker, GitLab.\n3. Опыт работы в роли Java Developer, разработка новых функций и компонентов, реализация приложения с использованием Spring Boot и микросервисов, выявление и устранение узких мест производительности, написание технической документации, разработка через тестирование, использование передовых методов проектирования, повторное использование и написание эффективного исходного кода.", "Период работы 2021-03-01 - None на позиции Senior Backend Engineer/Tech Lead.\nОпыт работы:\n- Разработка компонента для извлечения данных для отдела процессного анализа. Извлечение данных из ~15 источников данных (до 600 миллионов записей на задание), преобразование данных в журнал событий и последующая загрузка. Ключевые достижения:\n- Улучшение процесса извлечения данных. Руководство процессом от идеи до технического документа, затем ПКО реализации, затем к готовой к производству реализации. Улучшения касаются производительности, объема данных, масштабируемости.\n- Перенос инфраструктуры отдела с Terraform на AWS CDK на уровне департамента (IAM, S3, KMS, RDS, Athena).\n- Внедрение ручного загрузки файлов CSV/TSV.\n\nПериод работы 2018-12-01 - 2021-03-01 на позиции Backend Engineer.\nОпыт работы:\n- Разработка системы управления пользователями и аутентификацией/авторизацией (SAML, OAuth) для приложения моделирования бизнес-процессов в BPMN. Технологии: Java (Hibernate, Guice), MySQL, Gradle, Redis, Docker, Git, CircleCI.\n\nПериод работы 2018-01-01 - 2018-12-01 на позиции Software Engineer in Test.\nОпыт работы:\n- Разработка онлайн-редактора для бизнес-процессов в рамках BPMN. Ключевые достижения:\n- Внедрение непрерывного тестирования пользовательского интерфейса (~160 тестов). Технологии: Selenium, Selenide, Kotlin, Guice, CucumberJvm, Image comparison, Gradle.\n- Внедрение непрерывного тестирования API для Backend (~250 тестов). Технологии: Java, Gradle, Guice, TestNG, RestAssured.\n- Создание и поддержание стабильного и масштабируемого кластера браузеров для тестирования пользовательского интерфейса (Chrome, Firefox, IE11, Edge). Технологии: Selenoid, Jenkins.\n- Внедрение конвейеров Jenkins для тестирования пользовательского интерфейса и API.\n- Развертывание тестовых сред (Docker-compose).\n\nПериод работы 2017-08-01 - 2017-12-01 на позиции Backend Developer.\nОпыт работы:\n- Разработка высоконагруженных микросервисов для систем с местоположением. Технологии: Spring Boot, Spring Data, Elasticsearch, RabbitMQ, Hibernate, MySQL.\n\nПериод работы 2016-09-01 - 2017-12-01 на позиции Senior QA Automation Engineer.\nОпыт работы:\n- Разработка микросервисного приложения с веб/мобильными клиентами. Ключевые достижения:\n- Внедрение непрерывного тестирования Backend (>1000 тестов). Технологии: CucumberJvm, Spring, Java, Swagger, Docker, WireMock, Jenkins.\n- Внедрение непрерывного тестирования мобильных приложений (~100 тестов). Технологии: CucumberJvm, Spring, Java, Appium, Jenkins.\n- Создание и поддержание собственной фермы мобильных устройств для тестирования (6 физических устройств).\n\nПериод работы 2012-04-01 - 2016-09-01 на позиции QA Technical Lead.\nОпыт работы:\n- Руководство командой из 12 QA-инженеров (тестирование более 4000 компонентов Backend).\n- Создание и реализация стратегий тестирования продукта.\n- Обучение и поддержка людей в техническом развитии. Технологический стек: Fitnesse (Java) / maven / git, gerrit / Jenkins / SQL / bash.\n\nПериод работы 2011-01-01 - 2012-04-01 на позиции Test Lead.\nОпыт работы:\n- Создание процессов функционального, нагрузочного, производительного и юзабилити-тестирования.\n- Создание тестовых документов (тестовые случаи, планы тестирования, дизайн тестов).\n- Функциональное, UI-тестирование систем IPTV", "В период с 2018 по текущую дату работал в должности Software engineer. Занимался разработкой интеграционных серверов и серверов для миграции данных, оптимизацией запросов, покрытием кода тестами, работой с высоконагруженными системами, написанием микросервисов и проведением code review.", "Опыт работы:\n- Разработчик Java с 2020 года по настоящее время.\n- Разработка новых высоконагруженных микросервисов, поддержка существующих приложений и сервисов, исправление ошибок, взаимодействие с администраторами по техническому обслуживанию, анализ проблем в продакшне.\n- Работа в Agile-команде (SCRUM), выполнение код-ревью, написание юнит- и интеграционных тестов, настройка и участие в разработке процессов DevOps.\n- Стек: Java 17, Spring Framework, Kafka, NoSQL, Openshift, MongoDB.\n- Разработчик Java с 2018 года по 2020 год.\n- Разработка корпоративных приложений для клиентов компании (банки, энергетика и т.д.), код-ревью, написание модульных и интеграционных тестов, написание документации, участие в принятии архитектурных решений.\n- Стек: Java, Spring Framework, Kafka, NoSQL, MongoDB.", "Ключевые достижения:\n- Участие в разработке модульной системы передачи данных между командами внутри банка на основе фреймворка Apache Camel.\n- Разработка новых компонентов основного приложения для взаимодействия по gRPC FTP SFTP S3.\n- Рефакторинг и разработка нового функционала вспомогательных модулей основного приложения TFS.\n- Модификация функционала вспомогательных приложений Конструктора и Конфигуратор в разделах frontend и backend.\n- Внедрение функционала фронтенд-сервисов в рамках политики релиза проекта.\n- Оценка сложности проектирования, планирования и работы в спринтах (Agile Scrum).", "Ключевые достижения:\n\n- Опыт работы в роли Team Lead с использованием Kotlin, Java, Spring-Boot, Hibernate, Jooq, PostgreSQL, Kafka.\n- Опыт работы в роли Senior Java Software Engineer с использованием Java, C++, Hibernate, SpringBoot, PostgreSQL, Docker, Kubernetes, Bitbucket, Maven.\n- Опыт работы в роли Senior Developer с использованием Kotlin, Java, JDBC, SpringBoot, MySQL, Docker, Maven, Gradle, HazelCast.\n- Опыт работы в роли Co-Founder, Techdirect с использованием Kotlin, Protobuf, Hibernate, PostgreSQL, Spring, Nats, Consul, HazelCast.\n- Опыт разработки Flash игр в ActionScript 3 и интеграции с социальной сетью VKontakte.\n- Опыт разработки банковского программного обеспечения, включая мобильное интернет-банкинг для Android, графическую программу для настройки Android мобильного банкинга и систему текстового перевода на базе Oracle.\n- Опыт поиска рекламодателей, разработки программного обеспечения для удаленного управления и воспроизведения видео на основе технологии Digital Signage.\n- Опыт разработки веб-сайтов в PHP с использованием CMS ModX, а также веб-контента в ActionScript 3.\n- Опыт разработки Flash игры \"Truck Loader\" в ActionScript 3.\n- Опыт разработки информационного поискового сервиса для использования в университете, который позволяет искать и сортировать научные конференции, а также получать специальную информацию из текстовых материалов.", "Резюме описывает опыт работы в различных областях разработки программного обеспечения, включая разработку сервисов аутентификации и авторизации, настройку логирования и безопасности, разработку бизнес-логики и визуальных компонентов, создание архитектуры модулей бизнес-интеллекта, работу с различными базами данных и инструментами разработки.\n\nКлючевые достижения включают настройку логирования всей системы с использованием Fluent Bit и других систем, настройку безопасности системы с использованием специфических jwt токенов и протокола Oauth2.0, разработку проекта для демонстрации работы Протокола OAuth 2.0, создание универсального решения по выгрузке данных из различных баз данных и создание модуля бизнес-интеллекта полностью удовлетворяющего требованиям заказчика.", "Ключевые достижения:\n\n1. Участие в нескольких технических проектах, связанных с платформой данных SAP Hybris, в качестве консультанта, архитектора и разработчика.\n2. Руководство командой, ответственной за надежность продукта и разработку внутренних библиотек и инструментов.\n3. Разработка и поддержка переиспользуемых библиотек (ограничитель скорости, многослойный кэш, асинхронное сообщение и т.д.).\n4. Управление задачами SRE в мониторинге производства, достижение 95% доступности и успешное выполнение задач по разрешению инцидентов.\n5. Проведение 20 интервью для позиций разработчиков бэкенда.\n6. Разработка архитектурных слоев операционной платформы контроля баланса Treasury.\n7. Переход сервисов, работающих на базе WebSphere, на Docker-контейнеры, работающие в облаке VTB.\n8. Оптимизация производительности и эффективности обработки legacy-приложений.\n9. Внедрение автоматизации на различных этапах цикла разработки для повышения эффективности разработчиков.\n10. Разработка детекторного сервиса для обнаружения расхождений данных, что привело к сокращению ручной операционной работы на 50%.\n11. Ответственность за качество кодабазы путем проведения обзоров кода и продвижения культуры чистой и безопасной разработки, что привело к росту тестового покрытия с 5% до 60% за шесть месяцев.\n12. Менеджмент группы из 4 новичков-разработчиков в рамках расширения компании.\n13. Организация технических встреч (1 в месяц) на темы системного дизайна и тестирования.\n14. Успешное разрешение нескольких экстренных ситуаций с клиентами на высшем уровне.\n15. Разработка компонентов архитектуры для тестировочного и мониторингого шлюза.\n16. Быстрое изучение сложной модели данных и собственных фреймворков в течение нескольких недель после начала работы.\n17. Убеждение команды оптимизировать код, что привело к снижению объема кода на 20% благодаря введению более качественных алгоритмов и очистке кода.\n18. Участие в создании нового инструмента от чернового варианта до окончательного принятия клиентом, что решило проблему разделения холодных и горячих данных и увеличило пропускную способность большинства запросов к базе данных производства на 200%.\n19. Поездка в Китай для обучения 10+ инженеров на трех разных встречах в рамках усилий по укреплению команды.\n20. Основание комитета по контролю качества для мониторинга изменений схемы базы данных, что способствовало эволюции быстро развивающейся среды разработки.", "Ключевые достижения:\n- Разработка системы по сопровождению транспорта и грузов, пересекающих границы России;\n- Участие в проекте сбора оперативной статистики, построенном в виде микросервисов;\n- Разработка REST-сервиса поиска прикрепленных файлов к входящим XML-сообщениям;\n- Разработка системы электронной очереди, построенной в виде нескольких взаимодействующих между собой веб-сервисов.", "Ключевые достижения:\n\n1. Внедрил методологию Contract First и методологию описания архитектуры (потоки данных) платформы. Это позволило улучшить процесс разработки.\n2. Разработал Java приложение - генератор PlantUml скриптов для моделей: erd, state diagram. Приложение позволило устранить \"рисование\" из процесса проектирования моделей (erd, state).\n3. Спроектировал, разработал, протестировал и внедрил функциональность по пакетной миграции данных на Spring Batch (ETL).\n4. Разработал и внедрил метод оценки трудозатрат системного аналитика, который позволил точнее определять сроки выполнения работ.\n5. Внедрил функциональность прогнозирования расчетного страхового ТЗ (товарного запаса). Функциональность позволила снизить избыточный товарный запас (15%) по малооборачиваемым товарам.", "Период работы: 2020-08-01 - None на позиции Senior Java developer.\nДостижения: Разработка мобильного приложения банка, миграция из IBM MQ на Kafka, использование Java 17, Spring Boot, RabbitMQ, ActiveMQ, Kafka, Redis, Kubernetes, OpenShift, Hazelcast, TeamCity, Jenkins.\n\nПериод работы: 2018-08-01 - 2020-07-01 на позиции Team Lead Java.\nДостижения: Разработка биллинговой системы, развертывание CI/CD, поддержка системы, интеграция с ISO 20022 и КриптоПро 5, JCP 2.0, использование Java 8, Spring, Docker, PosgreSQL, Kafka, СМЭВ.\n\nПериод работы: 2016-09-01 - 2018-07-01 на позиции Старший Java-разработчик.\nДостижения: Разработка IDM-системы, использование Spring, MyBatis, Cache infinispan, WebLogicServer.\n\nПериод работы: 2015-07-01 - 2016-09-01 на позиции Разработчик / тестировщик.\nДостижения: Тестирование драйверов для 1С-Предприятия и оборудования, тестирование веб-сервисов, написание тест-кейсов, администрирование серверов, работа с SQL-запросами, использование IDEA, Java, JavaScript, Spring, Hibernate JPA, Extjs, PostgreSQL, MSSQL, GlassFish, Maven.\n\nПериод работы: 2009-06-01 - 2015-05-01 на позиции Руководитель проекта / разработчик.\nДостижения: Разработка карточек контрагентов и клиентов, разработка печатных форм, администрирование серверов, работа с Web приложениями, установка MySQL, Joomla, Wordpress, Apache, Fastreport, работа с Microsoft debugger, основы реляционных БД, чтение и понимание технической документации на русском и английском языках, хорошие коммуникативные навыки, аккуратность, внимательность, умение работать в команде.", "Период работы: 2021-11-01 - None на позиции Ведущий разработчик Java/Kotlin.\n\nОпыт работы:\n- Разработка и поддержка backend-систем и приложений на Java/Kotlin.\n- Создание и оптимизация баз данных, включая проектирование схемы и написание эффективных запросов.\n- Работа с фреймворками, такими как Spring или Kotlin Coroutines, для разработки веб-приложений и API.\n- Разработка RESTful сервисов и API для взаимодействия с фронтендом и другими системами.\n- Работа с системами контроля версий, такими как Git, для управления кодом и совместной разработки.\n- Развертывание и конфигурирование backend-приложений на серверах.\n- Управление безопасностью и аутентификацией в backend-системах.\n- Оптимизация производительности и масштабируемости backend-приложений.\n- Разработка и отладка backend-кода для обеспечения его качества и надежности.\n- Обеспечение поддержки и документирования разработанного кода.\n\nСтек: Java 11, Kotlin, PostgreSQL, MongoDB, Spring (Boot, Data, Security, Cloud, Rest, Webflux), Maven, Apache Kafka, ElasticSearch, Apache POI, Jackson, JAXB, Junit, Mockito, Gitlab, Docker, Kubernetes.\n\nПериод работы: 2021-08-01 - 2021-11-01 на позиции Разработчик Java/Scala.\n\nОпыт работы:\n- Разработка и поддержка серверной части приложений на Java/Scala.\n- Участие в анализе и проектировании архитектуры приложения.\n- Интеграция с внешними системами и API.\n- Работа с базами данных, написание SQL-запросов.\n- Написание и поддержка автоматических тестов.\n- Оптимизация производительности и масштабируемости приложений.\n- Исправление ошибок и участие в процессе отладки.\n- Взаимодействие с командой разработчиков, тестировщиками и аналитиками.\n- Соблюдение стандартов кодирования и соглашений команды разработчиков.\n\nСтек: Java 11, Scala, Spring Boot, PostgreSQL, Gitlab, Apache Kafka, Apache Druid, Apache Hadoop, Apache Hive, Apache Spark, Apache Zeppelin.\n\nПериод работы: 2020-06-01 - 2021-08-01 на позиции Разработчик Java.\n\nОпыт работы:\n- Разработка, тестирование и отладка backend-систем и приложений на Java.\n- Участие в разработке и оптимизации баз данных, включая проектирование схемы и написание простых запросов.\n- Поддержка и доработка существующего кода в соответствии с заданными требованиями и стандартами.\n- Работа под руководством более опытных разработчиков и участие в их код-ревью.\n- Создание и поддержка RESTful сервисов и API для взаимодействия с фронтендом и другими системами.\n- Изучение и применение фреймворков, таких как Spring, для разработки веб-приложений на Java.\n- Освоение инструментов разработки и отладки, таких как IntelliJ IDEA или Eclipse.\n- Участие в совместной разработке с командой разработчиков, тестировщиками и другими участниками проекта.\n- Активное обучение и самообразование с целью улучшения навыков разработки и понимания передовых технологий.\n- Соблюдение стандартов безопасности и лучших практик разработки при работе с кодом и данными.\n\nСтек: Java, Apache POI, JAXB, Spring Boot, JPA, Hibernate, PostgreSQL, Docker, REST, JUnit, Mockito, Maven, Git.\n\nПериод работы: 2018-10-01 - 2020-06-01 на позиции Руководитель проектов.\n\nОпыт работы:\n- Управление проектами по разработке ПО для проведения финансовых расчетов на российском оптовом рынке электроэнергии (ФРС).\n- Работа в команде из 10 человек.\n- Постановка задач командам разработки и аналитики.\n- Согласование и разработка ТЗ.\n- Код-ревью PL/SQL, Java.\n- Проведение приемочного тестирования ПО.\n- Сдача проектов заказчику.\n- Реализация проектов по созданию трёх новых ФРС и доработке и поддержке двух существующих ФРС", "Период работы 2021-11-01 - 2022-03-14 на позиции Software engineer.\n\nРазработка Интеграционной шины dragonpass. Проект представляет собой шину , содержащие микросервисные приложения (Spring Boot, k8s, docker, jenkins, bitbucket), которые служат для передачи, сохранения различных данных введения отчетов, для банков ВТБ, СБЕР. Команда: около из 10 человек. (tester, analyst, java back-end, PO) Задачи: Разработка с нуля. Писал интеграционные, модульные тесты. Искал и устранял баги, Поддерживал legacy код, Проводил код ревью Навыки: Архитектура: Микросервисная и монолитная, навыки проектирования систем. Паттерны: Интеграционные (EIP), Микросервисные (MSA), GOF, GRASP, SOLID, DRY, YAGNI, KISS. Технологии и фреймворки: Java SE 8/9/10/11, Spring Boot, Spring Data, Spring Security, Spring Cloud/Netflix. − Системы контроля версий: git, gitflow, github flow, bitbucket, github, gitlab. Сборка проектов: maven, gradle. − CI/CD конвейеры: Gitlab, Teamcity. − Базы данных SQL: PostgreSQL. Брокеры сообщений:, Kafka. Резюме обновлено 20 марта 2022 в 04:18 − Фреймворки: JPA, Hibernate, JDBC. Методологии разработки: Agile, Scrum, TDD.  ирование: JUnit, Mockito, Spring Testing Framework, Testcontainers. Управление проектом: Jira, Confluence. Системы миграции БД: Flyway. Микросервисы: Docker, Kubernetes, Helm, Redhat OpenShift Операционные системы: macOS, Linux, Windows. Вспомогательные языки программирования: Python, SQL. Анализ кода: Checkstyle, Sonarqube, Jasper.", "Период работы с 2016 по 2018 годы на позиции Java Software Engineer. Занимался разработкой и поддержкой корпоративной системы для менеджеров внутри компании. Работал с технологиями Java 8, Spring Boot, Kafka, PostgreSQL, Hadoop, Git. Также участвовал в разработке и тестировании REST API сервисов.\n\nС 2019 года работал над проектом по созданию, управлению кампаниями и отправке уведомлений клиентам. В рамках проекта использовались технологии Java 11, Spring Boot, Kafka, MongoDB, Docker, Git, Jenkins, BigQuery, Microservice architecture, Grafana, Kibana.\n\nВ период с 2017 по 2018 годы работал над проектом по разработке корпоративной системы для менеджеров внутри компании. Использовал технологии Java 8, Spring Boot, JOOQ, Reactor, PostgreSQL, Hadoop, Kafka, Git.\n\nВ период с 2017 по 2018 годы также занимался помощью разработчикам в поиске и устранении ошибок на информационной системе, установкой новых версий приложений и компонентов информационной системы.", "Ключевые достижения:\n- Управление командой разработки и развитие архитектуры продукта\n- Реализация микросервисной архитектуры и разработка распределенных многопоточных адаптеров\n- Создание команд серверной, фронтенд и мобильной разработки, планирование и управление проектом\n- Создание конфигурации, обучение нейросетей и разработка серверного приложения для работы с TensorFlow/RT Darknet", "Ключевые достижения:\n- Развитие и поддержка микросервисов по созданию корпоративных цифровых карт;\n- Обслуживание и поддержка существующего проекта;\n- Разработка и сопровождение микросервисов экоплатформы, позволяющих подключать и управлять партнерскими подписками, хранить каталог тарифных планов подписок;\n- Занимался разработкой системы мониторинга выполнения показателей KPI сектором менеджмента трейдинговой компании;\n- Реализация бизнес-логики, проектирование DTO и сущностей БД, unit-тестирование, оптимизация функционала, позволяющего оперировать информацией, хранящейся в БД (в том числе изменение и получение данных).", "Период работы 2015-09-01 - None на позиции Java Software Developer.\n\nОпыт работы:\n1. Работа над проектом для Московского фонда обязательного медицинского страхования (МФОМС) по созданию системы учета медицинских услуг и обработки счетов.\n2. Работа над проектом по интеграции с системой \"Parus\" для обмена данными о платежах.\n3. Разработка утилиты для проверки существования файлов на SMB-файловой системе.\n4. Утилита для проверки наличия назначений лекарств в базе данных.\n5. Утилита для интеграции с системой OpenEHR для передачи медицинских документов.\n6. Разработка сервера для DICOM-протокола для обмена медицинскими изображениями.\n7. Интеграция медицинской информационной системы (MIS) с электронной интегрированной медицинской картой (EIMC) в рамках единой государственной системы здравоохранения.\n8. Разработка серверной части для анализа медицинских счетов.\n9. Доступ к персональным данным пациентов через веб-форму.\n10. Участие в проекте интеграции с лабораторной информационной системой (LIS) в больнице Пирогова.\n11. Разработка модуля интеграции с региональной автоматизированной лабораторной информационной системой (RALIS).\n12. Разработка программы для автоматической установки и обновления ранних разработок.\n13. Ремонт и обслуживание медицинского оборудования, включая глюкометры, кардиографы, дыхательное оборудование, стоматологические кресла, фотометры, анализаторы крови и ультразвуковое оборудование.\n14. Разработка одноканальных кардиографов с использованием технологии Bluetooth.\n\nКлючевые достижения:\n1. Улучшение процесса создания счетов за медицинские услуги на 100 раз.\n2. Увеличение производительности системы на 38 раз.\n3. Увеличение производительности системы на 100 раз.\n4. Увеличение производительности системы на 15-20% благодаря использованию многопоточности.", "Ключевые достижения:\n- Создание платформы электронной коммерции Kaspi Shop, которая является ведущим цифровым маркетплейсом в Казахстане.\n- Улучшение пользовательского опыта, оптимизация производительности и обеспечение безопасности платформы.\n- Создание микросервисов Spring Boot, которые улучшили различные аспекты платформы.\n- Реализация RESTful API для бесперебойной связи между микросервисами.\n- Оптимизация производительности, масштабируемости и удобства обслуживания микросервисов.\n- Участие в методах гибкой разработки, таких как планирование спринтов и проверка кода.\n- Разработка критически важных веб-проектов для служб экстренной помощи, включая больницы, пожарные части и полицейские участки.\n- Внедрение инновационных решений, которые повысили операционную эффективность и сократили время реагирования для персонала служб экстренной помощи.\n- Разработка функционала бекенд-части для маркетплейса по продаже автозапчастей.", "Ключевые достижения:\n- Опыт работы с различными проектами, включая разработку мобильных приложений, автоматизацию процессов бронирования и оплаты, гемблинг приложения, а также участие в разработке государственных информационных систем.\n- Знание и применение различных технологий и инструментов, таких как Java, Spring, JPA, PostgreSQL, Kafka, Docker, Maven, Jira, GitLab, ELK, Jenkins.\n- Умение работать в команде, участвовать в обсуждении решений и реализовывать новый функционал в соответствии с требованиями заказчика.\n- Опыт покрытия кода unit-тестами, исправления багов, рефакторинга и оптимизации кода.", "В период с 2022-02-01 по None, работал на позиции Java developer. Занимался проектированием и разработкой микросервисов, проводил код-ревью. Использовал языки программирования Java 17, Spring Boot, Spring Data JPA + Hibernate, Spring Cloud OpenFeign, Spring Statemachine и другие инструменты. Работал с базами данных PostgreSQL, использовал CI/CD-системы Gradle, Docker, Github Action, Kubernetes.\n\nВ период с 2019-12-01 по 2022-02-01 занимал позицию ведущего специалиста. Проектировал и разрабатывал интеграции с внутренними и внешними системами, участвовал в обсуждении проектных вопросов. Использовал языки программирования Java 8/11, Spring Boot, Spring JDBC, Spring MVC, Spring Cloud Netflix, mapstruct, Kafka, Spring Cloud Stream, Spring Cloud Data Flow. Работал с базами данных PostgreSQL, MariaDB, использовал CI/CD-системы Gradle, Docker, bamboo, k8s.\n\nВ период с 2018-03-01 по 2019-12-01 работал на позиции разработчика. Использовал языки программирования Java 8/11, Spring, Spring Data MyBatis, Hibernate, Maven, WebLogic. Работал с базами данных Oracle, Postgre и ClickHouse.", "Опыт работы: 2020-06-01 - None на позиции Java Developer.\nОписание деятельности: Не указано.\nКлючевые достижения: Не указаны.", "Ключевые достижения:\n- Опыт разработки веб-приложений и платформ на языке программирования Java;\n- Знание стеков технологий, таких как Java 11, Spring Boot, Kafka, PostgreSQL, Hibernate;\n- Умение работать с системами контроля версий, такими как GitLab;\n- Опыт работы с Docker для контейнеризации приложений;\n- Участие в проектах по разработке Helpdesk и интеграции с основной системой;\n- Опыт проектирования элементов выставочных стендов, офисов и жилых помещений;\n- Разработка технологических процессов механической обработки и сборки элементов авиационных двигателей и наземных установок;\n- Подбор оборудования, оснастки, измерительных инструментов, режимов резания;\n- Работа с математическими моделями в CAD (Autocad, Inventor).", "Рекрутер может выделить следующие ключевые достижения кандидата:\n\n1. Опыт разработки backend частей на Kotlin и Java с использованием различных фреймворков и технологий, таких как Spring, Jpa, Exposed, Redis, gRPC, rest4j, Servlets, Freemarker, микросервисы.\n\n2. Опыт разработки frontend частей на GWT, Elm, VueJS с TypeScript.\n\n3. Опыт работы с продакшеном, включая включение фич и поиск причин багов.\n\n4. Опыт работы с большими базами данных, такими как PostgreSQL и Oracle.\n\n5. Опыт работы с различными инструментами мониторинга, такими как Grafana и VictoriaMetrics.\n\n6. Опыт работы с CI/CD процессами, включая настройку Jenkins и взаимодействие со специалистами DevOps.\n\n7. Опыт работы с аналитикой и написанием тест кейсов.", "Ключевые достижения:\n\n1. Опыт работы в роли Senior Java Developer, интеграция и доработка программного комплекса единой системы авторизации и аутентификации.\n2. Опыт работы в роли ведущего программиста, создание и поддержка микро сервисного приложения для обмена данными между другими сервисами компании и сторонними участниками.\n3. Опыт работы в роли ведущего программиста, разработка и поддержка системы выкупа, сопровождения, хранения и возврата кредитных обязательств и выпуска на их основе ценных бумаг.\n4. Опыт работы в роли программиста, поддержка и доработка внутренних систем компании ИСК Евро-Полис(Абсолют Страхование), сайтов компании и баз данных.\n5. Опыт работы в роли программиста, разработка и поддержка систем сбора, контроля и учета данных с удаленных нефтяных качалок до пультов управления и обслуживание нефтегазового оборудования.", "Период работы 2022-11-01 - None на позиции Java разработчик.\nПроект: Миграция. Обязанности: Разработка приложений с микросервисной архитектурой для миграции данных в единую банковскую систему «ДБО». Использование технологий java 11 версии, фреймворк Spring Boot, JPA- Hibernate, библиотеки Lombok и Mapstruct. В качестве репозитория кода – bitbacket, CICD – Teamcity, развертывание в OpenShift. Написание SQL скриптов для работы с данными БД (postgres, oracle) Покрытие кода юнит и интеграционными тестами. Сборка и выкатка релизных версий приложений на стенды. Исправление багов и написание нового функционала. Процесс код ревью коллег(включая смежные команды). Достижения: Смигрировали все данные из сторонних источников в единую систему ДБО, с помощью написания миграторов. Стек: java 11 версии, фреймворк Spring Boot, JPA- Hibernate, библиотеки Lombok и Mapstruct. В качестве репозитория кода – bitbacket, CICD – Teamcity, развертывание в OpenShift. БД (postgres, oracle), junit, kafka.\n\nПериод работы 2021-10-01 - 2022-09-01 на позиции Старший Java-разработчик.\nПроект: Маркетплейс. Задачи выполняемые на проекте: - Разработка серверной и клиентской части приложений на Java с использованием различных технологий - Анализ и оптимизация существующего кода для работы в высоконагруженных средах - Взаимодействие с сотрудниками других структурных подразделений компании для решения интеграционных задач - Взаимодействие с клиентами компании на уровне технических специалистов. Достижения: За год работы реализовал функционал маркетплейса по тендерам, то есть возможность продавцов и покупателей участвовать в них. Стек: Java 8, Spring Framework (Core, Data, MVC, Boot, Security, Integration), Hibernate/JPA, Apache Camel, Java EE, PostgreSQL, Kafka.\n\nПериод работы 2019-01-01 - 2021-09-01 на позиции Разработчик ПО.\nПроект: analitycal CRM. Задачи выполняемые на проекте: - Работа в scrum команде из 9 человек Analytical CRM. - Поддержка и разработка приложения EVAM. Дорабатываем коробку, приходится пилить много адаптеров. Стриминговое приложение создано для реалтайм взаимодействия с клиентами. - Мониторинг серверов и приложений банка с выводом в kibana и zabbix графики. - Работа с логами сбор и фильтрация Filebeat, Logstash, хранение и анализ Elasticsearch. - Разработка на java с junit тестами - Написание bash скриптов - CI CD bamboo - Разработка веб приложений с использованием spring boot - Работа с очередями kafka, ibmmq, activmq. - Написание REST сервисов. - работа с redis pg. Достижения: Настроил систему мониторинга приложения с нуля. Настроил CI CD процессы с нуля. Реализовал gitflow в команде. Внедрил вендорное приложение EVAM в систему банка, развернул на всех контурах. Подключил новые источники событий для бизнеса. Подчинение по структуре: product owner. Стек: java 8, Spring Boot, Kafka, Ibm MQ, Active Mq, Redis, Oracle, Postgresql, Zabbix, Kibana, Elasticsearch, Filebeat, Logstash, Bamboo, Bitbacket.\n\nПериод работы 2022-07-01 - 2023-02-27 на позиции Наставник.\nПроект: Курс java разработчика с 0 до градации мидл. Задачи выполняемые на проекте: Проверка домашнего задания. Индивидуальная консультации по 2 часа каждого ученика в неделю. Групповые консультации (разбор домашнего задания, разбор проведенных лекций). Проведение митапов (раскрытие дополнительных и интересных для учеников тем). Ведение статистики по успеваемости. Участие в собрании преподавателей. Достижения: Ученики достигли хороших результатов, многие из них трудоустроились и работают в it сфере", "Резюме опыта работы:\n\n1. Период работы с 2019 по 2022 год в качестве Senior Java Developer. Занимался проектированием распределенной архитектуры кластера, реализацией сборки и развертки кластера, созданием и настройкой метрик, а также проведением нагрузочного тестирования.\n\n2. Период работы с 2015 по 2019 год в качестве Java Developer. Занимался разработкой и сопровождением модулей бизнес-логики для MMORTS Art of War 3, а также разработкой инфраструктурных модулей и мониторингом ошибок. Также проводил оптимизацию SQL-запросов, устранял утечки и искал узкие места в системе.", "Ключевые достижения:\n\n1. Опыт работы с Java, Spring Boot, Docker, Kubernetes, Kafka и другими технологиями.\n2. Участие в разработке финансовых сервисов для финтех-компаний.\n3. Разработка кредитных сервисов для индивидуальных клиентов.\n4. Участие в разработке портала обмена валют с использованием микросервисов, Kafka и Docker.\n5. Опыт коучинга и менторства младших разработчиков, а также участие в планировании архитектуры проектов.\n6. Разработка облачного биллингового продукта, оптимизация CI/CD процессов.\n7. Участие в разработке инструментов для страховой компании Allianz.\n8. Опыт разработки HCS системы.", "В период с 2019 по 2023 год работал на позиции Java-Developer. Занимался разработкой, добавлением функционала, обслуживанием, дебагом JAVA приложений. Участвовал в разработке модульных и интеграционных тестов, составлении запросов к базе данных, настройке потока сообщений и имитации запросов клиента. Реализовал слой бизнес-логики от контроллера до базы данных. Также помогал коллегам решать технические задачи. Технический стек включал Java 8, 11, Spring (boot, web, cloud, data), WebFlux, PostgreSQL, Kubernetes, Docker, Hibernate, Liquibase, Kafka, ELK, Prometheus, Grafana, Swagger.", "Ключевые достижения:\n- Реализация backend архитектуры для общебанковской платформы лояльности;\n- Реализация логики управления тарифом;\n- Реализация 5 интеграций с сторонними системами;\n- Уменьшение количества таймаутов при обращении;\n- Внедрение интеграционных тестов;\n- Вывод в промышленную среду.\n\n- Реализация микросервисов с нуля для трекера задач Q.Tasks;\n- Проработка архитектуры;\n- Рефакторинг существующего кода, фикс багов;\n- Проведение код ревью;\n- Проведение интервью.\n\n- Разработка Backend части приложения для CRM;\n- Оптимизация и рефакторинг существующего кода;\n- Ревью кода;\n- Юнит тестирование.", "Период работы 2020-10-01 - None на позиции Middle Java developer (Java,JS):\n- Development of a new generation of contact center for Avaya Software language: Java, JS(Nodejs)\n- Technologies used in software development: Spring Boot, Kafka(Reactive), Docker, Kubernetes(k8s), k9s, Helm, Ansible, Redis Azure, Confluence, Jira, Jenkins, Bitbucket, SIP(Session Initiation Protocol), BDD/Junit testing\n\nПериод работы 2019-07-01 - 2019-12-01 на позиции Разработчик программного обеспечения с применением технологий Java Enterprise Edition:\n- Командная работа по созданию проекта Innder-сервиса поиска попутчиков)\n- Моя роль в команде сопровождалась реализацией следующих задач:\n   - Архитектура: На основании технического задания декомпозировал проект и построил архитектуру приложения на основе Spring Boot и реализовал бизнес-логику.\n   - Функциональность: Реализовал базовый процесс регистрации(Sing Up) на основе Spring Security c возможностью регистрироваться, проверять и cохранять пользовательские данные и процесс авторизации( Sign in)\n   - База данных: Использовал H2 для тестирования своей разработки\n   - Front: Работал над дизайном своей формы регистрации и авторизации, а так же главной страницы приложения с использованием JavaSqript, jQuery, CSS- framework- Bootstrap, шаблонизатор: thymeleaf. Сервер приложения реализован на Spring boot, Spring Security, ORM-Hibernate. База данных -Postgres\n   - Сервер с чат ботом Telegram:\n     - Получение оповещений о новых заявках в активных поездках;\n     - Подтверждение бронирований заявок;\n     - Получение оповещений о подтверждениях участия в поездках, со стороны инициатора;\n     - Получение оповещения о появлении новых поездок по указанному маршруту.\n   - web-interface написан с иcпользованием: 1. javaScript, jQuery; 2. шаблонизатор: thymeleaf 3. CSS- framework- Bootstrap\n   - Функции:\n     - Регистрация/авторизация;\n     - Создания/удаление своих маршрутов;\n     - Создание/удаление своих поездок;\n     - Бронирование участия в чужих поездках;\n     - Отмена бронирования участия в чужих поездках, как до подтверждения, так и после;\n     - Подтверждение/отклонение броней от других пользователей в своих поездках;\n\nПериод работы 2019-02-01 - 2019-07-01 на позиции Junior Java Developer:\n- За время обучения на курсах «Программирование на Java» мною было реализовано несколько проектов.\n   - I.1.WebStore/верстка сайта\n   - Функциональность/ список товаров/просмотр товаров/\n   - Cтек использованных технологий: Spring: Boot Web: Bootstrap CI:Travis Codecov\n   - II. 1. SocialNetwork/\n   - Функциональность:аутентификация и авторизация/ возможность добавления в друзья и удаление, список друзей (база друзей хранится в встраиваемой базе данных),обновление контактной информации и изменение пароля, просмотр последних сообщений, поиск.\n   - Cтек использованных технологий Spring: Boot, MVC, Data, Security Web: Bootstrap Tests: Junit CI:Travis DataBase:H2\n\nПериод работы 2017-07-01 - 2020-10-01 на позиции Руководитель бюро технологической подготовки:\n- Руководил работами по разработке и внедрению в производство особо ответственных, специальных технологических процессов.\n- Руководил работами по составлению графиков проверки технологических процессов и ежемесячно контролировал их выполнение.\n- Работал непосредственно с проприетарным программным обеспечением, взаимодействие подсистем, ЕИС с сервером подсистем PDM на базе сервис-ориентированной технологии SOA API\n- Работал с технологическими электронными моделями в подсистеме « Teamcenter 11» , принимал участие в отработке данных моделей в производство\n- Работал в единой информационной системе « Teamcenter 11» -автоматизированная система", "В период с 2021 по настоящее время работал на позиции Старший Java-разработчик. Основные обязанности включали разработку и поддержку микросервисов, оптимизацию запросов к базе данных, написание документации и проведение unit-тестов. Использовал Java 8/11, Spring Framework, JPA/Hibernate ORM, Apache Cassandra, PostgreSQL DB, JUnit, Maven, Gitlab CI/CD, Elasticsearch, k8s, Docker, Kafka.\n\nВ период с 2020 по 2021 год работал на позиции Java Developer. Основные обязанности включали разработку и поддержку CRM системы в торгово-логистической компании, проектирование RESTful API в соответствии с Best practice, проведение code-review и unit-тестирования.", "Опыт работы:\n\n- Java-разработчик (2019-09-01 - None)\n- Java-разработчик (2019-05-01 - 2019-09-01)\n- Java-программист (2018-01-01 - 2019-09-01)\n- Инженер-программист (2017-08-01 - 2018-03-01)\n- Эксперт по продажам (2015-10-01 - 2016-06-01)\n- Инженер по продажам (2007-09-01 - 2015-09-01)\n- Инженер-программист (2004-09-01 - 2007-09-01)\n\nКлючевые достижения:\n\n- Работа с различными технологиями и инструментами, включая Spring, Java EE, Oracle(pl\\sql), Front(jQuery, Angular 2, nodeJs), SAP Hybris, FlexibleSearch, Gradle, Jenkins, Bamboo, Git, TestNG, Junit4, Docker, JMH framework, Java Mission Control, Java Visual VM, 1C Предприятие, CRM Megaplan, CRM Lotus Notes/Domino, NS2000, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, 1С - Предприятие, CRM «Битрикс24», TeamViewer, AuthoCad, Photoshop, CorelDraw, FreeBSD, ", "Ключевые достижения:\n- Опыт работы в качестве Senior Java Developer с 2021 года.\n- Участие в проектах по коммуникациям с платежными системами и разделению монолита на микросервисы.\n- Использование технологий Java 11, 17, Spring, Kafka, Cassandra, PostgreSQL, Oracle.\n- Опыт работы в качестве Senior Java Software Engineer с 2018 года.\n- Разработка микросервисов на основе Spring Framework, Spring Boot, JHipster, Thymeleaf, gRPC, REST, SSO, SAML, Apache POI, PdfBox, Minio, Neo4j, MemSQL, MariaDB, Docker, Kafka.\n- Создание новых микросервисов с нуля на JHIpster/Spring Boot.\n- Разработка JHipster gateway, SSO аутентификации, gRPC веб-сервисов, REST-сервисов.\n- Опыт работы в качестве Senior PHP Developer с 2014 года.\n- Разработка медицинских веб-порталов на PHP, Lithium, Slim Framework, Twig, Vagrant, Docker, MySQL, Algolia, Elasticsearch, Less, jQuery.\n- Разработка внутренних инструментов на ExtJS, JQuery.\n- Создание микросервисной платформы на Silex, Twig.\n- Опыт работы в качестве Full Stack Engineer (Java/Javascript) с 2013 года.\n- Разработка высоконагруженных сервисов на Netty, Redis.\n- Разработка веб-сервисов на Spring Framework, JS.\n- Разработка системы удаленного развертывания на Spring Framework, JS.", "Ключевые достижения:\n\n1. Участие в разработке CRM системы для крупного иностранного заказчика.\n2. Работа над Java обучением, включая координацию, руководство командой разработчиков и менторов, а также проведение технических интервью.\n3. Разработка Rest веб-сервиса и SPA на базе HTML/CSS/JavaScript для учебного проекта на внутренних курсах EPAM.", "Опыт работы:\n- Java Developer (2021-05-01 - None)\n- Участие в доработке и добавлении нового функционала внутреннего портала по оценке KPI для сотрудников банка.\n- Рефакторинг и доработка компонентов по новым требованиям.\n- Создание API.\n- Увеличение производительности компонентов.\n- Code review.\n- Установка на тестовые стенды.\n- Выкатка релиза в продакшен.\n- Разбор и исправление инцидентов в промышленном контуре.\n- Написание unit тестов.\nСтек: Java 8 (Project Reactor, stream API), Spring Framework - Boot, Cloud, Webflux, Web, Security, PostgreSQL, Hibernate, Liquibase, Git - GitLab, Bitbucket, Netty, Tomcat, Maven, JUnit, TeamCity, Grafana, Elasticsearch, Kibana, Nginx, MobaXterm, Docker, Kubernetes (небольшой опыт).\n\n- Java Developer (2019-09-01 - 2021-05-01)\n- Создание корпоративного портала с приложением для обмена опытом сотрудниками.\n- Использование технологий: Java 8, Spring Framework - Boot, Web, Security, Data, PostgreSQL, Hibernate, Lombok, JUnit, Maven, Github.\n- Написание сущностей, установление отношений между ними, типов связей.\n- Создание API для фронта.\n- Обработка ответов для фронта.\n- Создание системы аутентификации c JWT-токеном.\n- Рефакторинг сущностей в зависимости от новых требований.\n- Написание unit тестов.", "Ключевые достижения:\n- Опыт работы в роли старшего Java-разработчика\n- Разработка бизнес логики проекта, код-ревью, оптимизация и рефакторинг существующего кода\n- Работа с БД, написание новых разделов\n- Разработка интеграционных тестов с использованием фреймворка TestContainer\n- Реализация множества новых фич на проекте\n- Разработка нового микросервиса cash-pooling с нуля\n- Опыт разработки ПО на Kotlin\n- Разработка приложения для поиска автомобильных запчастей на территории других стран\n- Использование различных технологий и инструментов, таких как MySQL, JDBC, PostgreSQL, Ci/CD, Hibernate/JPA, Spring Framework (Boot, Security, Data, Core), Java 8, Git, Docker, Tomcat, Bootstrap, JS (JQuery, Fetch, Ajax), HTML, Thymeleaf", "Ключевые достижения:\n\n1. Успешное участие в разработке высоконагруженной государственной информационной системы \"Федеральный реестр государственных и муниципальных услуг (функций) (ФГИС ФРГУ)\".\n2. Разработка и внедрение микросервисной архитектуры для проекта ФГИС ФРГУ.\n3. Участие в разработке CRM системы для производственных и оптовых компаний, которая покрывала задачи клиентов в вопросах администрирования, учёта по всем ключевым параметрам, сбора статистики и многие другие задачи.\n4. Разработка новых фич и сервисов для проекта ФГИС ФРГУ.\n5. Разработка документации для проектов.\n6. Анализ и проектирование архитектуры проектов.\n7. Контроль и сопровождение технической документации от разработчиков.\n8. Проведение код-ревью.\n9. Составление технической документации.\n10.Покрытие кода тестами.", "Ключевые достижения:\n- Опыт работы в различных отраслях, включая заказную разработку, продуктовую компанию, финансовый сектор и маркетинг.\n- Работа на позициях Senior java developer, Старший разработчик программного обеспечения и Teamlead.\n- Успешное управление проектами и командами разработчиков.\n- Разработка и поддержка различных проектов, включая заказные разработки и внутренние проекты компании.", "Ключевые достижения:\n- Внедрение общих стандартов использования БД, апи и других технологий.\n- Сокращение технического долга собственного сервиса.\n- Разработка минималистичной модели истории операций, что позволяет подключать новых поставщиков в разы быстрее.\n- Создание условий для эффективной работы сотрудников команды и всего проекта.\n- Внесение изменений в роли сотрудников: аналитик -&gt; разработчик, qa -&gt; автотестирование.", "Резюме содержит опыт работы в качестве инженера-программиста Java, разработчика и центра компетенций внедрения. В каждом периоде работы были выполнены различные задачи, связанные с разработкой и поддержкой программного обеспечения.\n\nВ период работы на позиции инженера-программиста Java (2021-05-01 - None) были выполнены следующие задачи: разработка функционала микросервисов, тестирование и документация, анализ и уточнение функциональных задач, кросс-ревью кода и обсуждение улучшений системы.\n\nВ период работы на позиции разработчика (2020-12-01 - 2021-04-01) были выполнены следующие задачи: разработка утилит для аналитики, отладка, написание комментариев к Java-документам и системный анализ, обучение коллег и наставничество младших специалистов.\n\nВ период работы на позиции разработчика - Центра компетенций внедрения и (2017-09-01 - 2020-12-01) были выполнены следующие задачи: участие в разработке и поддержке высоконагруженной системы технической поддержки, обучение коллег, изучение и применение новых технологий для проекта, анализ и уточнение функциональных задач, кросс-ревью кода и обсуждение улучшений системы, фронтенд разработка, написание тестов, разработка дизайна интерфейса, сбор и отображение статистики.", "Резюме опыта работы:\n\n1. Работа в качестве Java/Kotlin Developer с 2022-12-12 по настоящее время.\n2. Разработка и реализация платежных счетов валютных операций для клиентов, включая микросервисную архитектуру, front system, интеграционные взаимодействия на основе HTTP протокола, автоматизированную platform environment system, внутренний scenario в виде webflow.\n3. Работа над многофункциональным программным интерфейсом онлайн-кинотеатра с 2019-10-01 по 2022-12-01.\n4. Микросервисная архитектура, front system and back system, решения интеграционной архитектуры REST API и брокера сообщений Apache Kafka, решения технической архитектуры pipeline manager CI/CD и кластера на ядре Kubernetes.\n5. Разработка функционала, поддержка и доработка, refactoring, code review, bugfixing, выпуск и обновление контрактов.\n6. Использование стеков технологий: Java 11, Kotlin, Spring Framework (Web, Boot, Webflow, Data, Cloud), Hibernate, Lombok, MapStruct, Liquibase, PostgreSQL, MongoDB, Apache Kafka, RabbitMQ, Maven, OpenShift, Swagger, Bitbucket, Jira, Confluence.", "В период с 2021-05-25 по None, работал на позиции Java Developer. Занимался разработкой микросервисов для кредитного конвейера, использовал технологии Kubernetes, PostgreSQL, MongoDB, Kafka, REST, SOAP, IBM MQ, Oracle DB.\n\nВ период с 2019-01-25 по 2021-05-25 работал на позиции Главного специалиста. Занимался разработкой back-end системы ДБО для малого бизнеса на Java, Spring. Участвовал в написании тестов, проведении code review, выполнял задачи по разработке front-end на Vue.js.\n\nВ период с 2016-06-25 по 2018-10-25 работал на позиции Инженера-программиста. Реализовывал cron-таски для обработки транзакций, отправлял push-уведомления через Google FCM, интегрировался с другими системами через SOAP. Разрабатывал новые сервисы в рамках текущих задач.", "Ключевые достижения:\n- Разработка и проектирование онлайн-платформы для покупок в Интернете\n- Разработка и поддержка промежуточного программного обеспечения инфраструктуры с использованием архитектуры SOA\n- Разработка профессиональной консультационной платформы по ставкам на спорт \"Betting Up\"\n- Участие во всех этапах проектирования и разработки системы пограничного контроля \"Bayazet\"\n- Разработка приложения для уведомления пользователей о начале матчей и отображения результатов в реальном времени", "Ключевые достижения:\n\n1. Разработка архитектуры и разработка критических частей новой платформы для кредитного финансирования безопасности.\n2. Разработка интеграции с внешними платформами.\n3. Микросервис-разработка.\n4. Использование технологий и навыков: Java, Spring Boot, Oracle, Kafka.\n5. Работа в области торговли.\n\n2. Разработка единой платформы на проекте Montage для нового приложения в Credit Suisse.\n3. Разработка единой платформы.\n4. Микросервис-разработка.\n5. Использование технологий и навыков: Java, MongoDB, Spring Framework, Vert.x, PostgreSQL, Redis.\n6. Работа в области торговли.\n\n7. Разработка чата с оператором и ботом на сайтах sberbank.ru и sberbank online.\n8. Разработка высоконагруженной системы.\n9. Интеграция ненаделенного чата.\n10. Использование технологий и навыков: Apache ActiveMQ, Hibernate, Java, Oracle, Spring Framework, Vert.x, Kafka.\n11. Работа в банковской сфере.\n\n12. Разработка коллективного лицензирования авторских прав для корпоративных и академических пользователей авторских материалов.\n13. Разработка отчетов и генерации.\n14. Использование технологий и навыков: Java, TypeScript.\n15. Работа в сфере IT-услуг.\n\n16. Разработка ERP-системы для компании.\n17. Внедрение программного дизайна.\n18. Кодирование.\n19. Использование технологий и навыков: Java, JavaScript, SQL.\n20. Работа в сфере IT-услуг.", "Не люблю менять тему разговора, но вот сейчас тот самый случай.", "Опыт работы:\n- Senior Java Software Engineer (2019-05-01 - None): Разработка корпоративной системы служебных шин для финансового сектора. Работа с интеграционными решениями (jms, jdbc, http, soap, rest), декомпозиция задач для команды, использование стека технологий: Java 11, Spring Boot 2, Jdbc, PostgreSQL, Kafka, Apache Camel, ELK, Docker, Kubernetes, Maven, GitLab, Jira, Confluence.\n- Java Software Engineer (2016-06-01 - 2019-05-01): Участие в проектах: 1) Заявление на предоставление отчетности по ремонту и аренде подвижного состава (подрядчик ОАО \"РЖД\") - интеграция со сторонними системами с использованием протоколов soap и amqp, создание сложных бизнес-отчетов с использованием собственного sql; 2) Приложение для работы с API товарной биржи \"Санкт-Петербургская международная товарная биржа\" - работа с JDK 8, JSF, ActiveMQ, Hibernate, Wildfly, Postgres, Oracle, Flyway, apache POI.", "Ключевые достижения:\n\n1. Разработка сервиса по созданию и обработке заявок на предоставление кредита, карт с овердрафтом.\n2. Участие в разработке CRM систем для страховых компаний и малого и среднего бизнеса.\n3. Разработка микросервисов, оптимизация SQL запросов, исправление багов, разработка API и тестирование, проведение код ревью.", "В период с 2020-03-01 по 2022-04-01 работала на позиции Java-разработчик. Участвовала в разработке информационной системы по созданию и сопровождению договоров для физических и юридических лиц, взаимодействию с ними и всевозможному учету. Основные обязанности включали разработку сервисов внешних интеграций, реализацию нового функционала и различных слоев системы, поддержку существующей кодовой базы, исправление багов, рефакторинг и оптимизацию кода, проведение эстимации задач, проведение кросс ревью и покрытие кода тестированием. Использовала стек технологий: Java 11, Spring 5 (Boot, Web, Data), JPA, Hibernate, PostgeSQL, Kafka, REST, Maven, JUnit 5, Lombok, Jira.\n\nВ период с 2018-11-01 по 2020-01-01 работала на позиции Java-разработчик. Участвовала в разработке приложения по контролю за движением международных экспресс отправлений. Основной функционал заключался в управлении формирования заказа, формировании таможенных деклараций и общем контроле за передвижением товара. Основные обязанности включали разработку нового функционала и его поддержку, разработку слоя REST-контроллеров, сервисного слоя с реализацией бизнес-логики, проектирование DTO и сущностей БД, написание SQL-запросов к БД, покрытие кода тестированием, исправление багов, рефакторинг и оптимизацию кода. Использовала стек технологий: Java 8, Spring Framefowk (web, boot, security, data jpa), Hibernate ORM, Lombok, , PostgreSQL, JUnit, Maven, GitLab, Docker.", "Ключевые достижения:\n- Разработка архитектурных решений для бизнес-требований;\n- Ведущая роль в интеграции с внешними системами;\n- Разработка модулей безопасности на основе OIDC и протокола OAuth2 с помощью Keycloak для Apache Kafka;\n- Разработка потоковых приложений для рынка в режиме реального времени;\n- Участие в принятии архитектурных и бизнес-решений и разработке;\n- Разработка библиотек для потоковой обработки данных для внутреннего использования;\n- Участие в создании распределенной платформы для комплексной обработки событий;\n- Поддержание процессов CI-CD.", "Ключевые достижения:\n\n1. Разработка микросервисов на Java, Kotlin.\n2. Разработка системы автоматизации процессов кредитования.\n3. Разработка микросервисов на SpringBoot для тестирования платформы банка.\n4. Разработка приложения для проверки обратной совместимости API (JSON-RPC,REST, Protobuf, GraphQL) и доработка Jenkins Job.\n5. Проверка API на обратную совместимость.\n6. Разработка с нуля в одно лицо приложения \"Мобильная касса\" под Android.\n7. Разработка и успешное внедрение АРМ \"Управление наливом чугуна\", ПО для сбора данных с удаленных объектов автоматизации с последующей интеграцией в единую ИС, внедрение рацпредложений на предприятии.", "В период с 2022 по 2023 год работал Java-разработчиком в компании BIS. Основные обязанности включали описание технической документации микросервисов, изучение и внедрение новых технологий, разработку и внедрение новых функциональностей в существующие Java приложения, участие в code review, анализ и оптимизацию производительности приложений, участие в разработке архитектуры микросервисов, проектирование базы данных, проектирование объектов entity и DTO, составление JPQL/HQL/SQL-запросов, unit, integration и component тестирование. Использовал стек технологий: Java, Intellij IDEA, Spring Framework (Core, Web, Boot, Security, Data JPA, Cloud, Quartz, Websockets, AOP, REST, Actuator, Docs), REST (RestTemplate, WebTemplate, Feign), gRPC, Postman/BloomRPC, Hibernate ORM, MapStruct/ModelMapper, Lombok, Apache Commons, Jackson, Gson, Guava, JDBC, PostgreSQL, Flyway, JUnit, AssertJ, Mockito, Testcontainers, Wiremock/Mockserver, SLF4J/Logback, Apache Maven, Git, Minio, ElasticSearch, Swagger/OpenAPI, Redmine, Wiki, Nats, Kafka, Apache NIFI, Docker, CI/CD Gitlab, Kubernetes, Prometheus, Grafana.\n\nВ период с 2020 по 2022 год работал Java разработчиком в компаниях ISUC и Online Analytics Market. Основные обязанности включали разработку и внедрение новых функциональностей в Java-приложения, анализ и оптимизацию производительности приложений, выпуск REST-контроллеров, разработку бизнес-логики сервисного уровня, настройку сервера конфигурации, проектирование базы данных, проектирование объектов entity и DTO, составление JPQL/HQL/SQL-запросов, unit тестирование. Использовал стек технологий: Java, Intellij IDEA, Spring Framework (Core, Web, Boot, Security, Data JPA, AOP, REST, Cloud), JPA/Hibernate, MapStruct/ModelMapper, Lombok, Postman/Insomnia, Oracle SQL, Liquibase, JUnit, Mockito, SLF4J/Logback, Gradle, Git/Gitlab, Swagger, Atlassian JIRA, Atlassian Confluence, MongoDB/Mongock, Redis, ELK (ElasticSearch, Logstash, Kibana), RabbitMQ, CI/CD, Docker, Kubernetes.", "Ключевые достижения:\n\n1. Разработка и поддержка внутренних проектов компании.\n2. Разработка и поддержка сайта объявлений на базе микросервисов в связке Spring Cloud + Apache CXF.\n3. Разработка сервиса для интеграционного тестирования сайта Лондонской фондовой биржи.\n4. Разработка продукта компании Axelot Datareon ESB.\n5. Разработка приложений для завода на C#, Delphi, Visual FoxPro, MS SQL Server.\n6. Разработка Web-сервисов на базе SOAP для системы \"Находка-Загс\".\n7. Разработка портлетов (модулей) для BPMS системы Elewise ELMA и пользовательского интерфейса на KendoUI.\n8. Доработка приложения на QT, взаимодействующего с базой данных Firebird.", "В период с 2021 по None, работал на позиции Java Developer. Занимался разработкой программного продукта сбора и проверки данных для передачи их в другие системы. Участвовал в создании архитектуры приложения, спроектировал и разработал 5 микросервисов, настроил DevOps конфигурации для разработанных микросервисов, обучал младших сотрудников, покрывал код юнит и интеграционными тестами, участвовал в выводе проекта в промышленную эксплуатацию, декомпозировал задачи и распределял внутри команды. Стек: Java 11, Spring Boot, Kafka, Kafka Streams, Avro, MapStruct, WebClient, OpenApi, Maven, Bitbucket, Jenkins, Docker, Kubernetes, OpenShift, JUnit, Mockito, TestContainers, MockServer, Confluence, Jira, Scrum.\n\nВ период с 2019 по 2021, работал на позиции Java Developer. Занимался разработкой программного продукта для обеспечения единой системы взаимодействия между филиалами компании. Разработал API для кабинета клиента, спроектировал и создал 2 модуля, покрыл 90% кода юнит-тестами, проводил оценку задач, спроектировал базу данных с информацией о заказах клиента, настроил CI/CD приложения в GitLab, проводил собеседования. Стек: Java 11, Spring Boot, PostgreSQL, Maven, GitLab, Docker, MapStruct, Lombok, JUnit, Mockito, Swagger, Spring Security, Liquibase.\n\nВ период с 2018 по 2019, работал на позиции Java Developer. Занимался разработкой приложения для получения отчетов от сотрудников, работающих на выезде. Разрабатывал REST контроллеры, сервисы с бизнес-логикой, писал запросы к базе данных, редактировал шаблоны для фронтэнда. Стек: Java 8, MySQL, JDBC, Spring MVC, Thymeleaf, JUnit, Mockito, Spring Security, Git.", "В период с 2021 по 2022 год работал на позиции Старший Java разработчик. Участвовал в разработке бэкэнда приложения мобильного банка.\nВ период с 2020 по 2021 год работал на позиции Старший программист. Разрабатывал компоненты и их функциональную часть в рамках проекта \"Госуслуги\", проводил работы по отработке имеющегося функционала, корректировке VM шаблонов, работе со справочниками и таблицами БД. Использовал следующие технологии: Spring Boot, Spring Data, Spring MVC, GitLab, Oracle, Postgres, Apache Velocity, Postman, Jackson.\nВ период с 2020 по 2020 год работал на позиции Java Developer. Разрабатывал интеллектуальные системы, участвовал в разработке и создании Telegram и Rocket.Chat ботов для взаимодействия с биржей. Использовал следующие технологии: Spring Boot, Spring Data, Spring MVC, Telegram Bot API, RabbitMQ, Vert.X, Speechkit, Rocket.Chat API.\nВ период с 2019 по 2020 год работал на позиции Java Developer. Реализовывал компоненты проекта, участвовал в согласовании используемого стека технологий и анализировал алгоритмы компонентов для повышения производительности. Использовал следующие технологии: Spring Boot, Spring Data, Spring MVC, Apache Kafka, Jackson, Docker, Jenkins, PostgreSQL, H2, Camunda BPM (Camunda + Modeler), Maven, REST, Linux.", "В период с 2022-05-01 по настоящее время работал на позиции Software Engineer. Занимался разработкой микросервисов на Java/Kotlin и интеграцией их с третьими сторонами через JMS и Kafka. Активно участвовал в процессах DevOps, обсуждениях требований и написании документации.\n\nВ период с 2013-02-01 по 2022-05-01 работал на позиции Software Engineer. Участвовал в реализации маркетингового модуля для CRM системы для программы лояльности одной из крупнейших сетей автозаправочных станций. Также был членом команды, ответственной за внедрение фронт-офисной системы для крупного банка. В мои обязанности входило развитие основного функционала системы. Я принимал участие во всех этапах внедрения, включая подготовку технических спецификаций и обеспечение соответствия проекта требованиям банка. Был частью команды, работающей над несколькими проектами для международного банка. Моя роль включала разработку нового функционала для существующей CRM системы банка с использованием механизмов интеграции, таких как JMS и IBM MQ. Также я принимал активное участие во всех этапах внедрения и оказывал менторскую поддержку младшим разработчикам.\n\nВ период с 2009-10-01 по 2013-12-01 работал на позиции System Administrator. Отвечал за управление, поддержку и устранение неисправностей различных аппаратных и программных систем, включая VMWare ESX, Linux, Windows и AIX операционные системы. Также управлял базой данных Oracle и Oracle BI EE 10g & 11g, предоставляя техническую поддержку внутренним и внешним заинтересованным сторонам. Кроме того, участвовал в настройке и конфигурации веб-серверов nginx и IIS."]